{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The goal for integrating LLM with OntoSearcher's RDF mappings is to \n",
    "- give the LLM more context for more accruate classifcation and prediction so that it can infer from previous knoweldge graphs about the types of nanomaterials that might be present as well as other factors\n",
    "\n",
    "- help with the generation of SPARQL queries \n",
    "\n",
    "- help with the generation of new ontologies and RDF mappings for unkown data\n",
    "\n",
    "\n",
    "# Look into neo4j for convert knoweldge graphs into a database and then using that for graph rag \n",
    "\n",
    "# RDF visualization tool?\n",
    "\n",
    "- 2 parts to widget, rdf visualization and interactive thing, and llm interface"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# first we want to take our generated rdfs(for now, only have niosh, cpsc, and nanoKnowbase data, will add OSHA data soon)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Obtaining dependency information for neo4j from https://files.pythonhosted.org/packages/6a/57/94225fe5e9dabdc0ff60c88cbfcedf11277f4b34e7ab1373d3e62dbdd207/neo4j-5.28.1-py3-none-any.whl.metadata\n",
      "  Downloading neo4j-5.28.1-py3-none-any.whl.metadata (5.9 kB)\n",
      "Requirement already satisfied: pytz in /Users/pranavsingh/anaconda3/lib/python3.11/site-packages (from neo4j) (2022.7)\n",
      "Downloading neo4j-5.28.1-py3-none-any.whl (312 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m312.3/312.3 kB\u001b[0m \u001b[31m620.8 kB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hInstalling collected packages: neo4j\n",
      "Successfully installed neo4j-5.28.1\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loading complex RDF from ./mappings/cpsc_database.ttl as graph 'CPSC'...\n",
      "Parsed 29596 triples from ./mappings/cpsc_database.ttl\n",
      "RDF Entity Types:\n",
      "  http://purl.bioontology.org/ontology/npo#NPO_199: 2785 instances\n",
      "\n",
      "Top Predicates:\n",
      "  http://purl.org/dc/terms/description: 5792 uses\n",
      "  http://sbmi.uth.tmc.edu/ontology/ochv#C0034030: 3075 uses\n",
      "  http://purl.obolibrary.org/obo/MESH_D012306: 3075 uses\n",
      "  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C93400: 2785 uses\n",
      "  http://purl.bioontology.org/ontology/npo#NPO_1808: 2785 uses\n",
      "  http://www.w3.org/1999/02/22-rdf-syntax-ns#type: 2785 uses\n",
      "  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C43530: 2785 uses\n",
      "  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C93401: 2785 uses\n",
      "  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25464: 2778 uses\n",
      "  http://sbmi.uth.tmc.edu/ontology/ochv#C0036524: 294 uses\n",
      "\n",
      "Blank Node Patterns:\n",
      "  http://purl.org/dc/terms/description: subject=5570, object=0\n",
      "  http://sbmi.uth.tmc.edu/ontology/ochv#C0034030: subject=290, object=2785\n",
      "  http://purl.obolibrary.org/obo/MESH_D012306: subject=290, object=2785\n",
      "  http://purl.bioontology.org/ontology/npo#NPO_1338: subject=293, object=0\n",
      "  http://sbmi.uth.tmc.edu/ontology/ochv#C0036524: subject=294, object=0\n",
      "  http://www.ebi.ac.uk/efo/EFO_0000487: subject=294, object=0\n",
      "Creating nodes for entities with type declarations...\n",
      "Created 2785 typed entity nodes\n",
      "Processing properties and relationships...\n"
     ]
    },
    {
     "ename": "CypherTypeError",
     "evalue": "{code: Neo.ClientError.Statement.TypeError} {message: Property values can only be of primitive types or arrays thereof. Encountered: Map{description -> String(\"perception metrics data for PROD_1537\"), _id -> String(\"bnode_n9b1d44807a26478d85a9dc25bcfa925eb3076_CPSC\")}.}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mCypherTypeError\u001b[0m                           Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[7], line 451\u001b[0m\n\u001b[1;32m    444\u001b[0m loader \u001b[38;5;241m=\u001b[39m ComplexRDFLoader(\n\u001b[1;32m    445\u001b[0m     uri\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbolt://localhost:7687\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    446\u001b[0m     username\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mneo4j\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    447\u001b[0m     password\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124montosearcher\u001b[39m\u001b[38;5;124m\"\u001b[39m  \u001b[38;5;66;03m# Replace with your password\u001b[39;00m\n\u001b[1;32m    448\u001b[0m )\n\u001b[1;32m    450\u001b[0m \u001b[38;5;66;03m# Load files\u001b[39;00m\n\u001b[0;32m--> 451\u001b[0m loader\u001b[38;5;241m.\u001b[39mload_complex_rdf(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m./mappings/cpsc_database.ttl\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCPSC\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    452\u001b[0m loader\u001b[38;5;241m.\u001b[39mload_complex_rdf(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m./mappings/niosh_rdf_tutV2c.ttl\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mNIOSH\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    453\u001b[0m loader\u001b[38;5;241m.\u001b[39mload_complex_rdf(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m./mappings/NKB_RDF_V3.ttl\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mNKB\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "Cell \u001b[0;32mIn[7], line 372\u001b[0m, in \u001b[0;36mComplexRDFLoader.load_complex_rdf\u001b[0;34m(self, file_path, graph_name)\u001b[0m\n\u001b[1;32m    370\u001b[0m \u001b[38;5;66;03m# Add properties to the node\u001b[39;00m\n\u001b[1;32m    371\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m props:\n\u001b[0;32m--> 372\u001b[0m     session\u001b[38;5;241m.\u001b[39mrun(\u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[1;32m    373\u001b[0m \u001b[38;5;124m    MATCH (n \u001b[39m\u001b[38;5;124m{\u001b[39m\u001b[38;5;124muri: $uri})\u001b[39m\n\u001b[1;32m    374\u001b[0m \u001b[38;5;124m    SET n += $props\u001b[39m\n\u001b[1;32m    375\u001b[0m \u001b[38;5;124m    \u001b[39m\u001b[38;5;124m\"\"\"\u001b[39m, uri\u001b[38;5;241m=\u001b[39muri, props\u001b[38;5;241m=\u001b[39mprops)\n\u001b[1;32m    377\u001b[0m \u001b[38;5;66;03m# Create batch of relationships\u001b[39;00m\n\u001b[1;32m    378\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m relationships \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(relationships) \u001b[38;5;241m>\u001b[39m \u001b[38;5;241m0\u001b[39m:\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/work/session.py:328\u001b[0m, in \u001b[0;36mSession.run\u001b[0;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[1;32m    326\u001b[0m bookmarks \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_get_bookmarks()\n\u001b[1;32m    327\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m--> 328\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\u001b[38;5;241m.\u001b[39m_run(\n\u001b[1;32m    329\u001b[0m     query,\n\u001b[1;32m    330\u001b[0m     parameters,\n\u001b[1;32m    331\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdatabase,\n\u001b[1;32m    332\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mimpersonated_user,\n\u001b[1;32m    333\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdefault_access_mode,\n\u001b[1;32m    334\u001b[0m     bookmarks,\n\u001b[1;32m    335\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mnotifications_min_severity,\n\u001b[1;32m    336\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mnotifications_disabled_classifications,\n\u001b[1;32m    337\u001b[0m )\n\u001b[1;32m    339\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/work/result.py:236\u001b[0m, in \u001b[0;36mResult._run\u001b[0;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[0m\n\u001b[1;32m    234\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_pull()\n\u001b[1;32m    235\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[0;32m--> 236\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attach()\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/work/result.py:430\u001b[0m, in \u001b[0;36mResult._attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    428\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m    429\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[0;32m--> 430\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39mfetch_message()\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:184\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    182\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[1;32m    183\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 184\u001b[0m         func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m    185\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[1;32m    186\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/io/_bolt.py:864\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    860\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m    861\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[1;32m    862\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[1;32m    863\u001b[0m )\n\u001b[0;32m--> 864\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[1;32m    865\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n\u001b[1;32m    866\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/io/_bolt5.py:500\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[0;34m(self, tag, fields)\u001b[0m\n\u001b[1;32m    498\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_server_state_manager\u001b[38;5;241m.\u001b[39mstate \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbolt_states\u001b[38;5;241m.\u001b[39mFAILED\n\u001b[1;32m    499\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 500\u001b[0m     response\u001b[38;5;241m.\u001b[39mon_failure(summary_metadata \u001b[38;5;129;01mor\u001b[39;00m {})\n\u001b[1;32m    501\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[1;32m    502\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpool:\n",
      "File \u001b[0;32m~/anaconda3/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:254\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    252\u001b[0m handler \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandlers\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mon_summary\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    253\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[0;32m--> 254\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_hydrate_error(metadata)\n",
      "\u001b[0;31mCypherTypeError\u001b[0m: {code: Neo.ClientError.Statement.TypeError} {message: Property values can only be of primitive types or arrays thereof. Encountered: Map{description -> String(\"perception metrics data for PROD_1537\"), _id -> String(\"bnode_n9b1d44807a26478d85a9dc25bcfa925eb3076_CPSC\")}.}"
     ]
    }
   ],
   "source": [
    "import rdflib\n",
    "from rdflib.term import BNode\n",
    "from neo4j import GraphDatabase\n",
    "import os\n",
    "from typing import Dict, List, Set, Tuple\n",
    "import re\n",
    "\n",
    "class ComplexRDFLoader:\n",
    "    def __init__(self, uri: str, username: str, password: str):\n",
    "        \"\"\"Initialize connection to Neo4j\"\"\"\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "        self.bnode_map = {}  # Track blank nodes and their Neo4j IDs\n",
    "    \n",
    "    def close(self):\n",
    "        \"\"\"Close the Neo4j connection\"\"\"\n",
    "        self.driver.close()\n",
    "    \n",
    "    def create_schema_indexes(self):\n",
    "        \"\"\"Create schema-aware constraints and indexes\"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            # Create constraint on resource URIs\n",
    "            session.run(\"\"\"\n",
    "            CREATE CONSTRAINT IF NOT EXISTS FOR (n:Resource) REQUIRE n.uri IS UNIQUE\n",
    "            \"\"\")\n",
    "            \n",
    "            # Create entity-specific indexes based on RDF types\n",
    "            session.run(\"\"\"\n",
    "            CREATE INDEX IF NOT EXISTS FOR (n:Product) ON (n.uri)\n",
    "            \"\"\")\n",
    "            \n",
    "            session.run(\"\"\"\n",
    "            CREATE INDEX IF NOT EXISTS FOR (n:Assay) ON (n.uri)\n",
    "            \"\"\")\n",
    "            \n",
    "            session.run(\"\"\"\n",
    "            CREATE INDEX IF NOT EXISTS FOR (n:Material) ON (n.uri)\n",
    "            \"\"\")\n",
    "            \n",
    "            # Create indexes for common search properties\n",
    "            # These will vary based on your ontology\n",
    "            property_indexes = [\n",
    "                \"NPO_1808\",  # nanomaterial type\n",
    "                \"label\",\n",
    "                \"C93401\",    # product type\n",
    "                \"description\"\n",
    "            ]\n",
    "            \n",
    "            for prop in property_indexes:\n",
    "                session.run(f\"\"\"\n",
    "                CREATE INDEX IF NOT EXISTS FOR (n:Resource) ON (n.{prop})\n",
    "                \"\"\")\n",
    "    \n",
    "    def extract_ontology_terms(self, g):\n",
    "        \"\"\"\n",
    "        Extract ontology term information to enrich the graph\n",
    "        \"\"\"\n",
    "        ontology_info = {}\n",
    "        \n",
    "        # Find all class definitions\n",
    "        class_query = \"\"\"\n",
    "        SELECT ?class ?label ?comment\n",
    "        WHERE {\n",
    "            { ?class a owl:Class } UNION { ?class a rdfs:Class }\n",
    "            OPTIONAL { ?class rdfs:label ?label }\n",
    "            OPTIONAL { ?class rdfs:comment ?comment }\n",
    "        }\n",
    "        \"\"\"\n",
    "        \n",
    "        try:\n",
    "            for row in g.query(class_query):\n",
    "                class_uri = str(row)\n",
    "                ontology_info[class_uri] = {\n",
    "                    \"type\": \"Class\",\n",
    "                    \"label\": str(row.label) if row.label else None,\n",
    "                    \"comment\": str(row.comment) if row.comment else None\n",
    "                }\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying ontology classes: {e}\")\n",
    "        \n",
    "        # Find all property definitions\n",
    "        property_query = \"\"\"\n",
    "        SELECT ?prop ?label ?comment ?domain ?range\n",
    "        WHERE {\n",
    "            { ?prop a owl:ObjectProperty } UNION \n",
    "            { ?prop a owl:DatatypeProperty } UNION\n",
    "            { ?prop a rdf:Property }\n",
    "            OPTIONAL { ?prop rdfs:label ?label }\n",
    "            OPTIONAL { ?prop rdfs:comment ?comment }\n",
    "            OPTIONAL { ?prop rdfs:domain ?domain }\n",
    "            OPTIONAL { ?prop rdfs:range ?range }\n",
    "        }\n",
    "        \"\"\"\n",
    "        \n",
    "        try:\n",
    "            for row in g.query(property_query):\n",
    "                prop_uri = str(row.prop)\n",
    "                ontology_info[prop_uri] = {\n",
    "                    \"type\": \"Property\",\n",
    "                    \"label\": str(row.label) if row.label else None,\n",
    "                    \"comment\": str(row.comment) if row.comment else None,\n",
    "                    \"domain\": str(row.domain) if row.domain else None,\n",
    "                    \"range\": str(row.range) if row.range else None\n",
    "                }\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying ontology properties: {e}\")\n",
    "        \n",
    "        return ontology_info\n",
    "    \n",
    "    def analyze_graph_structure(self, g):\n",
    "        \"\"\"\n",
    "        Analyze the RDF graph to identify entity types and key relationships\n",
    "        \"\"\"\n",
    "        # Find all RDF type declarations\n",
    "        type_counts = {}\n",
    "        \n",
    "        for s, p, o in g.triples((None, rdflib.RDF.type, None)):\n",
    "            obj_type = str(o)\n",
    "            if obj_type not in type_counts:\n",
    "                type_counts[obj_type] = 0\n",
    "            type_counts[obj_type] += 1\n",
    "        \n",
    "        # Identify key entity types based on frequency\n",
    "        entity_types = sorted(type_counts.items(), key=lambda x: x[1], reverse=True)\n",
    "        \n",
    "        print(\"RDF Entity Types:\")\n",
    "        for entity_type, count in entity_types[:10]:  # Show top 10\n",
    "            print(f\"  {entity_type}: {count} instances\")\n",
    "        \n",
    "        # Analyze predicate usage\n",
    "        predicate_counts = {}\n",
    "        \n",
    "        for s, p, o in g:\n",
    "            pred = str(p)\n",
    "            if pred not in predicate_counts:\n",
    "                predicate_counts[pred] = 0\n",
    "            predicate_counts[pred] += 1\n",
    "        \n",
    "        # Identify key predicates\n",
    "        key_predicates = sorted(predicate_counts.items(), key=lambda x: x[1], reverse=True)\n",
    "        \n",
    "        print(\"\\nTop Predicates:\")\n",
    "        for pred, count in key_predicates[:10]:  # Show top 10\n",
    "            print(f\"  {pred}: {count} uses\")\n",
    "        \n",
    "        # Identify blank node patterns\n",
    "        bnode_patterns = {}\n",
    "        \n",
    "        for s, p, o in g:\n",
    "            if isinstance(s, BNode):\n",
    "                if str(p) not in bnode_patterns:\n",
    "                    bnode_patterns[str(p)] = {\"as_subject\": 0, \"as_object\": 0}\n",
    "                bnode_patterns[str(p)][\"as_subject\"] += 1\n",
    "            \n",
    "            if isinstance(o, BNode):\n",
    "                if str(p) not in bnode_patterns:\n",
    "                    bnode_patterns[str(p)] = {\"as_subject\": 0, \"as_object\": 0}\n",
    "                bnode_patterns[str(p)][\"as_object\"] += 1\n",
    "        \n",
    "        print(\"\\nBlank Node Patterns:\")\n",
    "        for pred, counts in bnode_patterns.items():\n",
    "            print(f\"  {pred}: subject={counts['as_subject']}, object={counts['as_object']}\")\n",
    "        \n",
    "        return {\n",
    "            \"entity_types\": entity_types,\n",
    "            \"key_predicates\": key_predicates,\n",
    "            \"bnode_patterns\": bnode_patterns\n",
    "        }\n",
    "    \n",
    "    def clean_property_name(self, uri: str) -> str:\n",
    "        \"\"\"\n",
    "        Extract a clean property name from a URI\n",
    "        \"\"\"\n",
    "        # Extract the last part after '/' or '#'\n",
    "        if '#' in uri:\n",
    "            last_part = uri.split('#')[-1]\n",
    "        else:\n",
    "            last_part = uri.split('/')[-1]\n",
    "        \n",
    "        # Remove any invalid characters for Neo4j property names\n",
    "        clean_name = re.sub(r'[^a-zA-Z0-9_]', '_', last_part)\n",
    "        \n",
    "        # Ensure it doesn't start with a number\n",
    "        if clean_name[0].isdigit():\n",
    "            clean_name = 'p_' + clean_name\n",
    "        \n",
    "        return clean_name\n",
    "    \n",
    "    def get_entity_labels(self, g, uri: str) -> List[str]:\n",
    "        \"\"\"\n",
    "        Determine logical Neo4j labels based on RDF types\n",
    "        \"\"\"\n",
    "        labels = [\"Resource\"]  # Default label\n",
    "        \n",
    "        for _, _, o in g.triples((rdflib.URIRef(uri), rdflib.RDF.type, None)):\n",
    "            type_uri = str(o)\n",
    "            \n",
    "            # Map specific ontology types to Neo4j labels\n",
    "            if \"NPO_199\" in type_uri:\n",
    "                labels.append(\"Product\")\n",
    "            elif \"OBI_0000070\" in type_uri:\n",
    "                labels.append(\"Assay\")\n",
    "            elif \"material\" in type_uri.lower():\n",
    "                labels.append(\"Material\")\n",
    "            elif \"experiment\" in type_uri.lower():\n",
    "                labels.append(\"Experiment\")\n",
    "            \n",
    "            # Add the specific type as a label\n",
    "            specific_label = self.clean_property_name(type_uri)\n",
    "            if len(specific_label) > 0 and specific_label not in labels:\n",
    "                labels.append(specific_label)\n",
    "        \n",
    "        return labels\n",
    "    \n",
    "    def process_blank_node(self, g, bnode, graph_name: str, depth: int = 0) -> Dict:\n",
    "        \"\"\"\n",
    "        Process a blank node and its properties recursively\n",
    "        \"\"\"\n",
    "        if depth > 5:  # Prevent infinite recursion\n",
    "            return {\"_error\": \"Max recursion depth reached\"}\n",
    "        \n",
    "        # Check if we've already processed this blank node\n",
    "        bnode_str = str(bnode)\n",
    "        if bnode_str in self.bnode_map:\n",
    "            return {\"_ref\": self.bnode_map[bnode_str]}\n",
    "        \n",
    "        properties = {}\n",
    "        \n",
    "        # Process all properties of the blank node\n",
    "        for p, o in g.predicate_objects(bnode):\n",
    "            pred_name = self.clean_property_name(str(p))\n",
    "            \n",
    "            if isinstance(o, BNode):\n",
    "                # For nested blank nodes, we create a reference only\n",
    "                bnode_id = f\"bnode_{bnode_str.replace(':', '_')}_{graph_name}\"\n",
    "                properties[pred_name] = f\"REF:{bnode_id}\"\n",
    "            elif isinstance(o, rdflib.URIRef):\n",
    "                properties[pred_name] = str(o)\n",
    "            else:\n",
    "                # Literal value\n",
    "                value = str(o)\n",
    "                try:\n",
    "                    # Try to convert to appropriate type\n",
    "                    if o.datatype:\n",
    "                        datatype = str(o.datatype)\n",
    "                        if any(t in datatype for t in ['integer', 'decimal', 'double', 'float']):\n",
    "                            value = float(value)\n",
    "                        elif 'boolean' in datatype:\n",
    "                            value = value.lower() == 'true'\n",
    "                except:\n",
    "                    pass\n",
    "                \n",
    "                properties[pred_name] = value\n",
    "        \n",
    "        # Generate a unique ID for this blank node in Neo4j\n",
    "        bnode_id = f\"bnode_{bnode_str.replace(':', '_')}_{graph_name}\"\n",
    "        self.bnode_map[bnode_str] = bnode_id\n",
    "    \n",
    "        # Instead of returning complex nested objects, we'll create separate nodes for blank nodes\n",
    "        # and create relationships between them\n",
    "        with self.driver.session() as session:\n",
    "            session.run(\"\"\"\n",
    "            MERGE (n:BlankNode {id: $id})\n",
    "            SET n.graph = $graph\n",
    "            RETURN n\n",
    "            \"\"\", id=bnode_id, graph=graph_name)\n",
    "            \n",
    "            # Add all the simple properties\n",
    "            simple_props = {k: v for k, v in properties.items() if not str(v).startswith(\"REF:\")}\n",
    "            if simple_props:\n",
    "                session.run(\"\"\"\n",
    "                MATCH (n:BlankNode {id: $id})\n",
    "                SET n += $props\n",
    "                \"\"\", id=bnode_id, props=simple_props)\n",
    "        \n",
    "        return {\"_id\": bnode_id}\n",
    "    \n",
    "    \n",
    "    def load_complex_rdf(self, file_path: str, graph_name: str):\n",
    "        \"\"\"\n",
    "        Load a complex RDF file with special handling for blank nodes and entity types\n",
    "        \"\"\"\n",
    "        print(f\"Loading complex RDF from {file_path} as graph '{graph_name}'...\")\n",
    "        \n",
    "        # Parse the Turtle file\n",
    "        g = rdflib.Graph()\n",
    "        g.parse(file_path, format=\"turtle\")\n",
    "        print(f\"Parsed {len(g)} triples from {file_path}\")\n",
    "        \n",
    "        # Analyze graph structure to understand entity types\n",
    "        structure = self.analyze_graph_structure(g)\n",
    "        \n",
    "        # Extract ontology information\n",
    "        ontology_info = self.extract_ontology_terms(g)\n",
    "        \n",
    "        # Create schema-aware constraints and indexes\n",
    "        self.create_schema_indexes()\n",
    "        \n",
    "        # Process the data in stages\n",
    "        with self.driver.session() as session:\n",
    "            # Reset blank node mapping for this file\n",
    "            self.bnode_map = {}\n",
    "            \n",
    "            # 1. First pass: Create all nodes for subjects with type declarations\n",
    "            print(\"Creating nodes for entities with type declarations...\")\n",
    "            typed_entities = set()\n",
    "            \n",
    "            for s, p, o in g.triples((None, rdflib.RDF.type, None)):\n",
    "                if not isinstance(s, BNode):\n",
    "                    typed_entities.add(str(s))\n",
    "            \n",
    "            # Process in batches\n",
    "            batch_size = 1000\n",
    "            for i in range(0, len(typed_entities), batch_size):\n",
    "                batch = list(typed_entities)[i:i+batch_size]\n",
    "                entity_data = []\n",
    "                \n",
    "                for uri in batch:\n",
    "                    labels = self.get_entity_labels(g, uri)\n",
    "                    entity_data.append({\n",
    "                        \"uri\": uri,\n",
    "                        \"labels\": labels,\n",
    "                        \"graph\": graph_name\n",
    "                    })\n",
    "                \n",
    "                # Create nodes with appropriate labels\n",
    "                session.run(\"\"\"\n",
    "                UNWIND $entities AS entity\n",
    "                CALL apoc.create.node(\n",
    "                    entity.labels,\n",
    "                    {uri: entity.uri, graphs: [entity.graph]}\n",
    "                )\n",
    "                YIELD node\n",
    "                RETURN count(*)\n",
    "                \"\"\", entities=entity_data)\n",
    "            \n",
    "            print(f\"Created {len(typed_entities)} typed entity nodes\")\n",
    "            \n",
    "            # 2. Process properties and relationships for each entity\n",
    "            print(\"Processing properties and relationships...\")\n",
    "            processed = 0\n",
    "            \n",
    "           # Process properties and relationships for each entity\n",
    "            for uri in typed_entities:\n",
    "                entity_uri = rdflib.URIRef(uri)\n",
    "                props = {}\n",
    "                relationships = []\n",
    "                \n",
    "                # Get all properties of this entity\n",
    "                for p, o in g.predicate_objects(entity_uri):\n",
    "                    if p == rdflib.RDF.type:\n",
    "                        continue  # Already handled\n",
    "                    \n",
    "                    pred_name = self.clean_property_name(str(p))\n",
    "                    \n",
    "                    if isinstance(o, BNode):\n",
    "                        # Process blank node properties - create relationship to blank node\n",
    "                        bnode_props = self.process_blank_node(g, o, graph_name)\n",
    "                        bnode_id = bnode_props.get(\"_id\")\n",
    "                        \n",
    "                        if bnode_id:\n",
    "                            # Add a relationship to the blank node\n",
    "                            relationships.append({\n",
    "                                \"from_uri\": uri,\n",
    "                                \"to_id\": bnode_id,\n",
    "                                \"type\": pred_name,\n",
    "                                \"is_blank_node\": True,\n",
    "                                \"properties\": {\n",
    "                                    \"uri\": str(p),\n",
    "                                    \"graph\": graph_name\n",
    "                                }\n",
    "                            })\n",
    "                    elif isinstance(o, rdflib.URIRef):\n",
    "                        # Regular relationship to another entity\n",
    "                        relationships.append({\n",
    "                            \"from_uri\": uri,\n",
    "                            \"to_uri\": str(o),\n",
    "                            \"type\": pred_name,\n",
    "                            \"is_blank_node\": False,\n",
    "                            \"properties\": {\n",
    "                                \"uri\": str(p),\n",
    "                                \"graph\": graph_name\n",
    "                            }\n",
    "                        })\n",
    "                    else:\n",
    "                        # Regular property\n",
    "                        value = str(o)\n",
    "                        try:\n",
    "                            # Try to convert to appropriate type\n",
    "                            if o.datatype:\n",
    "                                datatype = str(o.datatype)\n",
    "                                if any(t in datatype for t in ['integer', 'decimal', 'double', 'float']):\n",
    "                                    value = float(value)\n",
    "                                elif 'boolean' in datatype:\n",
    "                                    value = value.lower() == 'true'\n",
    "                        except:\n",
    "                            pass\n",
    "                        \n",
    "                        props[pred_name] = value\n",
    "                \n",
    "                # Add properties to the node\n",
    "                if props:\n",
    "                    session.run(\"\"\"\n",
    "                    MATCH (n {uri: $uri})\n",
    "                    SET n += $props\n",
    "                    \"\"\", uri=uri, props=props)\n",
    "    \n",
    "    # Create batch of relationships\n",
    "    if relationships and len(relationships) > 0:\n",
    "        for i in range(0, len(relationships), batch_size):\n",
    "            rel_batch = relationships[i:i+batch_size]\n",
    "            \n",
    "            # Process regular entity relationships\n",
    "            regular_rels = [r for r in rel_batch if not r[\"is_blank_node\"]]\n",
    "            if regular_rels:\n",
    "                session.run(\"\"\"\n",
    "                UNWIND $relationships AS rel\n",
    "                MERGE (from:Resource {uri: rel.from_uri})\n",
    "                MERGE (to:Resource {uri: rel.to_uri})\n",
    "                WITH from, to, rel\n",
    "                CALL apoc.create.relationship(from, rel.type, rel.properties, to)\n",
    "                YIELD rel as created\n",
    "                RETURN count(*)\n",
    "                \"\"\", relationships=regular_rels)\n",
    "            \n",
    "            # Process blank node relationships\n",
    "            blank_rels = [r for r in rel_batch if r[\"is_blank_node\"]]\n",
    "            if blank_rels:\n",
    "                session.run(\"\"\"\n",
    "                UNWIND $relationships AS rel\n",
    "                MERGE (from:Resource {uri: rel.from_uri})\n",
    "                MERGE (to:BlankNode {id: rel.to_id})\n",
    "                WITH from, to, rel\n",
    "                CALL apoc.create.relationship(from, rel.type, rel.properties, to)\n",
    "                YIELD rel as created\n",
    "                RETURN count(*)\n",
    "                \"\"\", relationships=blank_rels)\n",
    "                \n",
    "                # Create batch of relationships\n",
    "                if relationships and len(relationships) > 0:\n",
    "                    for i in range(0, len(relationships), batch_size):\n",
    "                        rel_batch = relationships[i:i+batch_size]\n",
    "                        \n",
    "                        # Create relationships\n",
    "                        session.run(\"\"\"\n",
    "                        UNWIND $relationships AS rel\n",
    "                        MERGE (from:Resource {uri: rel.from_uri})\n",
    "                        MERGE (to:Resource {uri: rel.to_uri})\n",
    "                        CALL apoc.create.relationship(from, rel.type, rel.properties, to)\n",
    "                        YIELD rel as created\n",
    "                        RETURN count(*)\n",
    "                        \"\"\", relationships=rel_batch)\n",
    "                \n",
    "                processed += 1\n",
    "                if processed % 1000 == 0:\n",
    "                    print(f\"Processed {processed}/{len(typed_entities)} entities\")\n",
    "            \n",
    "            print(f\"Completed processing {processed} entities\")\n",
    "            \n",
    "            # 3. Add ontology information if available\n",
    "            if ontology_info:\n",
    "                print(\"Adding ontology metadata...\")\n",
    "                ontology_batch = []\n",
    "                \n",
    "                for uri, info in ontology_info.items():\n",
    "                    ontology_batch.append({\n",
    "                        \"uri\": uri,\n",
    "                        \"type\": info[\"type\"],\n",
    "                        \"label\": info[\"label\"],\n",
    "                        \"comment\": info[\"comment\"],\n",
    "                        \"domain\": info.get(\"domain\"),\n",
    "                        \"range\": info.get(\"range\"),\n",
    "                        \"graph\": graph_name\n",
    "                    })\n",
    "                \n",
    "                # Process in batches\n",
    "                for i in range(0, len(ontology_batch), batch_size):\n",
    "                    batch = ontology_batch[i:i+batch_size]\n",
    "                    \n",
    "                    session.run(\"\"\"\n",
    "                    UNWIND $batch AS item\n",
    "                    MERGE (n:Resource {uri: item.uri})\n",
    "                    SET n:OntologyTerm\n",
    "                    SET n += {\n",
    "                        termType: item.type,\n",
    "                        label: item.label,\n",
    "                        comment: item.comment,\n",
    "                        domain: item.domain,\n",
    "                        range: item.range,\n",
    "                        graphs: CASE\n",
    "                            WHEN n.graphs IS NULL THEN [item.graph]\n",
    "                            WHEN NOT item.graph IN n.graphs THEN n.graphs + item.graph\n",
    "                            ELSE n.graphs\n",
    "                        END\n",
    "                    }\n",
    "                    \"\"\", batch=batch)\n",
    "                \n",
    "                print(f\"Added {len(ontology_info)} ontology terms\")\n",
    "        \n",
    "        print(f\"Finished loading complex RDF from {file_path}\")\n",
    "\n",
    "\n",
    "# Example usage\n",
    "if __name__ == \"__main__\":\n",
    "    # Configure connection\n",
    "    loader = ComplexRDFLoader(\n",
    "        uri=\"bolt://localhost:7687\",\n",
    "        username=\"neo4j\",\n",
    "        password=\"ontosearcher\"  # Replace with your password\n",
    "    )\n",
    "    \n",
    "    # Load files\n",
    "    loader.load_complex_rdf(\"./mappings/cpsc_database.ttl\", \"CPSC\")\n",
    "    loader.load_complex_rdf(\"./mappings/niosh_rdf_tutV2c.ttl\", \"NIOSH\")\n",
    "    loader.load_complex_rdf(\"./mappings/NKB_RDF_V3.ttl\", \"NKB\")\n",
    "    \n",
    "    loader.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/pranavsingh/anaconda3/lib/python3.11/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).\n",
      "  from pandas.core import (\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection successful\n",
      "Neo4j connection test passed!\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "def test_connection():\n",
    "    uri = \"bolt://localhost:7687\"\n",
    "    username = \"neo4j\"\n",
    "    password = \"ontosearcher\"  # Use your actual password\n",
    "    \n",
    "    try:\n",
    "        with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "            with driver.session() as session:\n",
    "                result = session.run(\"RETURN 'Connection successful' AS message\")\n",
    "                print(result.single()[\"message\"])\n",
    "        print(\"Neo4j connection test passed!\")\n",
    "    except Exception as e:\n",
    "        print(f\"Neo4j connection failed: {e}\")\n",
    "\n",
    "test_connection()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database cleared successfully\n"
     ]
    }
   ],
   "source": [
    "def clear_database():\n",
    "    uri = \"bolt://localhost:7687\"\n",
    "    username = \"neo4j\"\n",
    "    password = \"ontosearcher\"  # Use your actual password\n",
    "    \n",
    "    driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "    \n",
    "    try:\n",
    "        with driver.session() as session:\n",
    "            # This will delete all nodes and relationships in the database\n",
    "            session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "            print(\"Database cleared successfully\")\n",
    "    finally:\n",
    "        driver.close()\n",
    "clear_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import openai\n",
    "from neo4j import GraphDatabase\n",
    "import json\n",
    "from typing import List, Dict, Any, Optional\n",
    "\n",
    "\n",
    "class ComplexRDFQuerier:\n",
    "    \"\"\"\n",
    "    Specialized query functions for complex RDF data in Neo4j\n",
    "    \"\"\"\n",
    "    def __init__(self, uri: str, username: str, password: str):\n",
    "        \"\"\"Initialize connection to Neo4j\"\"\"\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "    \n",
    "    def close(self):\n",
    "        \"\"\"Close the Neo4j connection\"\"\"\n",
    "        self.driver.close()\n",
    "    \n",
    "    def get_entity_schema(self):\n",
    "        \"\"\"\n",
    "        Retrieve the schema of the graph based on actual data patterns\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            # Get node labels and their property keys\n",
    "            node_schema = session.run(\"\"\"\n",
    "            CALL apoc.meta.schema()\n",
    "            YIELD value\n",
    "            RETURN value\n",
    "            \"\"\").single()[\"value\"]\n",
    "            \n",
    "            # Get relationship types\n",
    "            rel_types = session.run(\"\"\"\n",
    "            CALL db.relationshipTypes() YIELD relationshipType\n",
    "            RETURN collect(relationshipType) as types\n",
    "            \"\"\").single()[\"types\"]\n",
    "            \n",
    "            return {\n",
    "                \"node_schema\": node_schema,\n",
    "                \"relationship_types\": rel_types\n",
    "            }\n",
    "    \n",
    "    def explore_entity(self, entity_uri: str):\n",
    "        \"\"\"\n",
    "        Deep exploration of a single entity and its connections\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            # Get entity properties\n",
    "            entity_data_record = session.run(\"\"\"\n",
    "            MATCH (n {uri: $uri})\n",
    "            RETURN \n",
    "                n.uri as uri, \n",
    "                labels(n) as labels,\n",
    "                [prop IN keys(n) WHERE prop <> 'uri' AND NOT prop STARTS WITH '_'] as properties,\n",
    "                {\n",
    "                    // Extract actual property values\n",
    "                    entity_props: apoc.map.submap(n, \n",
    "                        [prop IN keys(n) WHERE prop <> 'uri' AND NOT prop STARTS WITH '_'])\n",
    "                } as data\n",
    "            \"\"\", uri=entity_uri).single()\n",
    "            \n",
    "            if not entity_data_record:\n",
    "                return {\"error\": f\"Entity {entity_uri} not found\"}\n",
    "            \n",
    "            # Convert Neo4j Record to a regular dictionary\n",
    "            entity_data = dict(entity_data_record)\n",
    "            \n",
    "            # Get incoming relationships\n",
    "            incoming = session.run(\"\"\"\n",
    "            MATCH (other)-[r]->(n {uri: $uri})\n",
    "            RETURN \n",
    "                other.uri as from_uri,\n",
    "                labels(other) as from_labels,\n",
    "                type(r) as relationship,\n",
    "                properties(r) as properties\n",
    "            \"\"\", uri=entity_uri).data()\n",
    "            \n",
    "            # Get outgoing relationships\n",
    "            outgoing = session.run(\"\"\"\n",
    "            MATCH (n {uri: $uri})-[r]->(other)\n",
    "            RETURN \n",
    "                other.uri as to_uri,\n",
    "                labels(other) as to_labels,\n",
    "                type(r) as relationship,\n",
    "                properties(r) as properties\n",
    "            \"\"\", uri=entity_uri).data()\n",
    "            \n",
    "            # Combine all data\n",
    "            result = entity_data  # Use the dictionary directly\n",
    "            result[\"incoming_relationships\"] = incoming\n",
    "            result[\"outgoing_relationships\"] = outgoing\n",
    "            \n",
    "            return result\n",
    "    \n",
    "    def query_by_type(self, entity_type: str, limit: int = 100):\n",
    "        \"\"\"\n",
    "        Query entities by their RDF type\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(\"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE $type IN labels(n)\n",
    "            RETURN \n",
    "                n.uri as uri, \n",
    "                labels(n) as labels,\n",
    "                [prop IN keys(n) WHERE prop <> 'uri' AND NOT prop STARTS WITH '_'] as property_keys,\n",
    "                {\n",
    "                    // Extract key properties for display\n",
    "                    label: n.label,\n",
    "                    description: n.description,\n",
    "                    name: n.name\n",
    "                } as common_props\n",
    "            LIMIT $limit\n",
    "            \"\"\", type=entity_type, limit=limit).data()\n",
    "            \n",
    "            return result\n",
    "    \n",
    "    def path_query(self, start_entity: str, end_entity: str, max_depth: int = 4):\n",
    "        \"\"\"\n",
    "        Find paths between two entities\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            paths = session.run(\"\"\"\n",
    "            MATCH path = shortestPath((start {uri: $start_uri})-[*1..$max_depth]-(end {uri: $end_uri}))\n",
    "            RETURN \n",
    "                [node in nodes(path) | node.uri] as node_uris,\n",
    "                [node in nodes(path) | labels(node)] as node_labels,\n",
    "                [rel in relationships(path) | type(rel)] as relationships,\n",
    "                length(path) as path_length\n",
    "            ORDER BY path_length\n",
    "            LIMIT 5\n",
    "            \"\"\", start_uri=start_entity, end_uri=end_entity, max_depth=max_depth).data()\n",
    "            \n",
    "            return paths\n",
    "    \n",
    "    def basic_search(self, search_term: str, limit: int = 50):\n",
    "        \"\"\"\n",
    "        Basic search function that avoids complex property handling\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            # Simple search by common properties\n",
    "            results = session.run(\"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE n.uri IS NOT NULL AND (\n",
    "                (n.NPO_1808 IS NOT NULL AND n.NPO_1808 CONTAINS $search_term) OR\n",
    "                (n.description IS NOT NULL AND n.description CONTAINS $search_term) OR\n",
    "                (n.label IS NOT NULL AND n.label CONTAINS $search_term) OR\n",
    "                (n.C93401 IS NOT NULL AND n.C93401 CONTAINS $search_term)\n",
    "            )\n",
    "            RETURN\n",
    "                n.uri as uri,\n",
    "                labels(n) as labels,\n",
    "                n.NPO_1808 as nanomaterial,\n",
    "                n.description as description,\n",
    "                n.label as label,\n",
    "                n.C93401 as product_type\n",
    "            LIMIT $limit\n",
    "            \"\"\", search_term=search_term, limit=limit).data()\n",
    "            \n",
    "            return results\n",
    "    \n",
    "    def fetch_cpsc_nodes(self, limit=50):\n",
    "        \"\"\"\n",
    "        Simple function to fetch CPSC nodes\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE 'CPSC' IN n.graphs\n",
    "            RETURN \n",
    "              n.uri AS uri,\n",
    "              labels(n) AS labels,\n",
    "              properties(n) AS props\n",
    "            LIMIT $limit\n",
    "            \"\"\"\n",
    "            \n",
    "            results = session.run(query, limit=limit).data()\n",
    "            \n",
    "            # Process results to make them more readable\n",
    "            processed_results = []\n",
    "            for result in results:\n",
    "                processed_result = {\n",
    "                    \"uri\": result[\"uri\"],\n",
    "                    \"labels\": result[\"labels\"],\n",
    "                    \"properties\": {}\n",
    "                }\n",
    "                \n",
    "                # Add non-array properties\n",
    "                for key, value in result[\"props\"].items():\n",
    "                    if key != \"uri\" and key != \"graphs\":\n",
    "                        processed_result[\"properties\"][key] = value\n",
    "                \n",
    "                processed_results.append(processed_result)\n",
    "            \n",
    "            return processed_results\n",
    "    \n",
    "    def fetch_niosh_nodes(self, limit=50):\n",
    "        \"\"\"\n",
    "        Simple function to fetch NIOSH nodes\n",
    "        \"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE 'NIOSH' IN n.graphs\n",
    "            RETURN \n",
    "              n.uri AS uri,\n",
    "              labels(n) AS labels,\n",
    "              properties(n) AS props\n",
    "            LIMIT $limit\n",
    "            \"\"\"\n",
    "            \n",
    "            results = session.run(query, limit=limit).data()\n",
    "            \n",
    "            # Process results to make them more readable\n",
    "            processed_results = []\n",
    "            for result in results:\n",
    "                processed_result = {\n",
    "                    \"uri\": result[\"uri\"],\n",
    "                    \"labels\": result[\"labels\"],\n",
    "                    \"properties\": {}\n",
    "                }\n",
    "                \n",
    "                # Add non-array properties\n",
    "                for key, value in result[\"props\"].items():\n",
    "                    if key != \"uri\" and key != \"graphs\":\n",
    "                        processed_result[\"properties\"][key] = value\n",
    "                \n",
    "                processed_results.append(processed_result)\n",
    "            \n",
    "            return processed_results\n",
    "\n",
    "\n",
    "class NanotoxicologyRAG:\n",
    "    \"\"\"\n",
    "    Retrieval-Augmented Generation (RAG) system for nanotoxicology data\n",
    "    \"\"\"\n",
    "    def __init__(self, \n",
    "                 neo4j_uri: str, \n",
    "                 neo4j_user: str, \n",
    "                 neo4j_password: str,\n",
    "                 openai_api_key: str,\n",
    "                 model: str = \"gpt-3.5-turbo\"):\n",
    "        \"\"\"\n",
    "        Initialize the RAG system for nanotoxicology\n",
    "        \"\"\"\n",
    "        self.driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_password))\n",
    "        self.openai_client = openai.OpenAI(api_key=openai_api_key)\n",
    "        self.model = model\n",
    "\n",
    "    def close(self):\n",
    "        \"\"\"Close the database connection\"\"\"\n",
    "        self.driver.close()\n",
    "        \n",
    "    def query_cpsc_products(self, search_term=None, limit=50):\n",
    "        \"\"\"Query CPSC products\"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            query = \"\"\"\n",
    "            MATCH (product)\n",
    "            WHERE 'CPSC' IN product.graphs\n",
    "            AND (\n",
    "              $search_term IS NULL OR\n",
    "              (product.NPO_1808 IS NOT NULL AND product.NPO_1808 CONTAINS $search_term) OR\n",
    "              (product.C93401 IS NOT NULL AND product.C93401 CONTAINS $search_term) OR\n",
    "              (product.C43530 IS NOT NULL AND product.C43530 CONTAINS $search_term)\n",
    "            )\n",
    "            RETURN \n",
    "              product.uri AS uri,\n",
    "              product.NPO_1808 AS nanomaterial,\n",
    "              product.C43530 AS manufacturer,\n",
    "              product.C93401 AS product_type,\n",
    "              product.C25464 AS country,\n",
    "              product.C93400 AS category\n",
    "            LIMIT $limit\n",
    "            \"\"\"\n",
    "            \n",
    "            return session.run(query, search_term=search_term, limit=limit).data()\n",
    "    \n",
    "    def query_niosh_assays(self, search_term=None, limit=50):\n",
    "        \"\"\"Query NIOSH assay data\"\"\"\n",
    "        with self.driver.session() as session:\n",
    "            query = \"\"\"\n",
    "            MATCH (assay)\n",
    "            WHERE 'NIOSH' IN assay.graphs\n",
    "            AND 'Assay' IN labels(assay)\n",
    "            AND (\n",
    "              $search_term IS NULL OR\n",
    "              (assay.label IS NOT NULL AND assay.label CONTAINS $search_term) OR\n",
    "              (assay.description IS NOT NULL AND assay.description CONTAINS $search_term)\n",
    "            )\n",
    "            RETURN \n",
    "              assay.uri AS uri,\n",
    "              assay.label AS name,\n",
    "              assay.description AS description,\n",
    "              assay.SIO_000300 AS value,\n",
    "              assay.SIO_000221 AS unit\n",
    "            LIMIT $limit\n",
    "            \"\"\"\n",
    "            \n",
    "            return session.run(query, search_term=search_term, limit=limit).data()\n",
    "    \n",
    "    def analyze_question(self, question):\n",
    "        \"\"\"\n",
    "        Analyze the user's question to determine query strategy\n",
    "        \"\"\"\n",
    "        prompt = f\"\"\"\n",
    "        Analyze this question about nanotoxicology and determine the key search criteria.\n",
    "        \n",
    "        Question: {question}\n",
    "        \n",
    "        Please identify:\n",
    "        1. Mentioned nanomaterials (e.g., silver, titanium dioxide, carbon nanotubes)\n",
    "        2. Product types or categories (e.g., baby products, kitchenware, air filters)\n",
    "        3. Toxicology assays or endpoints (e.g., cytotoxicity, genotoxicity, LDH assay)\n",
    "        4. Exposure routes (e.g., inhalation, dermal)\n",
    "        5. Target organs or organisms (e.g., lung, skin, mice)\n",
    "        \n",
    "        Return as JSON with these keys: \n",
    "        {{\"nanomaterials\": [...], \"products\": [...], \"assays\": [...], \"exposure_routes\": [...], \"targets\": [...]}}\n",
    "        \"\"\"\n",
    "        \n",
    "        # Using the new OpenAI API\n",
    "        response = self.openai_client.chat.completions.create(\n",
    "            model=self.model,\n",
    "            messages=[\n",
    "                {\"role\": \"system\", \"content\": \"You are a nanotoxicology expert assistant.\"},\n",
    "                {\"role\": \"user\", \"content\": prompt}\n",
    "            ],\n",
    "            temperature=0.3\n",
    "        )\n",
    "        \n",
    "        try:\n",
    "            result_text = response.choices[0].message.content.strip()\n",
    "            return json.loads(result_text)\n",
    "        except:\n",
    "            # Fallback if JSON parsing fails\n",
    "            return {\n",
    "                \"nanomaterials\": [],\n",
    "                \"products\": [],\n",
    "                \"assays\": [],\n",
    "                \"exposure_routes\": [],\n",
    "                \"targets\": []\n",
    "            }\n",
    "    \n",
    "    def retrieve_relevant_data(self, analysis):\n",
    "        \"\"\"\n",
    "        Retrieve data relevant to the question based on analysis\n",
    "        with safer type handling\n",
    "        \"\"\"\n",
    "        results = {\n",
    "            \"cpsc_products\": [],\n",
    "            \"niosh_assays\": [],\n",
    "            \"combined_data\": [],\n",
    "            \"nanomaterial_stats\": []\n",
    "        }\n",
    "        \n",
    "        # Query CPSC products - safe version\n",
    "        try:\n",
    "            for material in analysis.get(\"nanomaterials\", []):\n",
    "                product_results = self.query_cpsc_products(material)\n",
    "                results[\"cpsc_products\"].extend(product_results)\n",
    "            \n",
    "            for product in analysis.get(\"products\", []):\n",
    "                product_results = self.query_cpsc_products(product)\n",
    "                results[\"cpsc_products\"].extend(product_results)\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying CPSC products: {e}\")\n",
    "            # Try a simpler product query if the main one fails\n",
    "            try:\n",
    "                simple_query = \"\"\"\n",
    "                MATCH (product)\n",
    "                WHERE 'CPSC' IN product.graphs\n",
    "                AND product.NPO_1808 IS STRING\n",
    "                RETURN \n",
    "                product.uri AS uri,\n",
    "                product.NPO_1808 AS nanomaterial,\n",
    "                product.C43530 AS manufacturer,\n",
    "                product.C93401 AS product_type,\n",
    "                product.C25464 AS country,\n",
    "                product.C93400 AS category\n",
    "                LIMIT 10\n",
    "                \"\"\"\n",
    "                results[\"cpsc_products\"] = self.run_query(simple_query)\n",
    "            except:\n",
    "                pass\n",
    "        \n",
    "        # Query NIOSH assays - safe version\n",
    "        try:\n",
    "            for assay in analysis.get(\"assays\", []):\n",
    "                assay_results = self.query_niosh_assays(assay)\n",
    "                results[\"niosh_assays\"].extend(assay_results)\n",
    "            \n",
    "            for target in analysis.get(\"targets\", []):\n",
    "                assay_results = self.query_niosh_assays(target)\n",
    "                results[\"niosh_assays\"].extend(assay_results)\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying NIOSH assays: {e}\")\n",
    "            # Try a simpler assay query if the main one fails\n",
    "            try:\n",
    "                simple_query = \"\"\"\n",
    "                MATCH (assay)\n",
    "                WHERE 'NIOSH' IN assay.graphs\n",
    "                AND 'Assay' IN labels(assay)\n",
    "                AND assay.label IS STRING\n",
    "                RETURN \n",
    "                assay.uri AS uri,\n",
    "                assay.label AS name,\n",
    "              assay.description AS description,\n",
    "                assay.SIO_000300 AS value,\n",
    "                assay.SIO_000221 AS unit\n",
    "                LIMIT 10\n",
    "                \"\"\"\n",
    "                results[\"niosh_assays\"] = self.run_query(simple_query)\n",
    "            except:\n",
    "                pass\n",
    "        \n",
    "        # Get product stats by nanomaterial - safe version\n",
    "        try:\n",
    "            if analysis.get(\"nanomaterials\") or not results[\"cpsc_products\"]:\n",
    "                query = \"\"\"\n",
    "                MATCH (product)\n",
    "                WHERE 'CPSC' IN product.graphs\n",
    "                AND product.NPO_1808 IS STRING\n",
    "                WITH product.NPO_1808 AS material, count(*) AS count\n",
    "                RETURN material, count\n",
    "                ORDER BY count DESC\n",
    "                \"\"\"\n",
    "                results[\"nanomaterial_stats\"] = self.run_query(query)\n",
    "        except Exception as e:\n",
    "            print(f\"Error getting nanomaterial stats: {e}\")\n",
    "        \n",
    "        # Try to find connections - safe version\n",
    "        try:\n",
    "            if results[\"cpsc_products\"] and results[\"niosh_assays\"]:\n",
    "                # Manual approach to find connections\n",
    "                combined_data = []\n",
    "                for product in results[\"cpsc_products\"]:\n",
    "                    nanomaterial = product.get(\"nanomaterial\", \"\")\n",
    "                    if not nanomaterial or not isinstance(nanomaterial, str):\n",
    "                        continue\n",
    "                        \n",
    "                    for assay in results[\"niosh_assays\"]:\n",
    "                        description = assay.get(\"description\", \"\")\n",
    "                        if not description or not isinstance(description, str):\n",
    "                            continue\n",
    "                            \n",
    "                        # Simple substring check\n",
    "                        if nanomaterial.lower() in description.lower():\n",
    "                            combined_data.append({\n",
    "                                \"product\": product,\n",
    "                                \"assay\": assay,\n",
    "                                \"relevance\": \"Material match\"\n",
    "                            })\n",
    "                \n",
    "                results[\"combined_data\"] = combined_data\n",
    "        except Exception as e:\n",
    "            print(f\"Error finding connections: {e}\")\n",
    "        \n",
    "        # Deduplicate results\n",
    "        results[\"cpsc_products\"] = self._deduplicate_by_uri(results[\"cpsc_products\"])\n",
    "        results[\"niosh_assays\"] = self._deduplicate_by_uri(results[\"niosh_assays\"])\n",
    "        \n",
    "        return results\n",
    "\n",
    "    def _deduplicate_by_uri(self, items):\n",
    "        \"\"\"Helper to deduplicate items by URI\"\"\"\n",
    "        seen_uris = set()\n",
    "        unique_items = []\n",
    "        \n",
    "        for item in items:\n",
    "            uri = item.get(\"uri\")\n",
    "            if uri and uri not in seen_uris:\n",
    "                seen_uris.add(uri)\n",
    "                unique_items.append(item)\n",
    "        \n",
    "        return unique_items\n",
    "    \n",
    "    def format_results_for_context(self, results):\n",
    "        \"\"\"\n",
    "        Format query results into context for the LLM\n",
    "        \"\"\"\n",
    "        context = \"# Nanotoxicology Knowledge Base Results\\n\\n\"\n",
    "        \n",
    "        # Format CPSC product information\n",
    "        if results[\"cpsc_products\"]:\n",
    "            context += \"## Consumer Products containing Nanomaterials\\n\\n\"\n",
    "            for i, product in enumerate(results[\"cpsc_products\"][:10], 1):\n",
    "                context += f\"{i}. Product: {product.get('product_type', 'Unknown')}\\n\"\n",
    "                context += f\"   Nanomaterial: {product.get('nanomaterial', 'Not specified')}\\n\"\n",
    "                context += f\"   Manufacturer: {product.get('manufacturer', 'Not specified')}\\n\"\n",
    "                context += f\"   Country: {product.get('country', 'Not specified')}\\n\"\n",
    "                context += f\"   Category: {product.get('category', 'Not specified')}\\n\\n\"\n",
    "        \n",
    "        # Format NIOSH assay information\n",
    "        if results[\"niosh_assays\"]:\n",
    "            context += \"## Toxicology Assay Information\\n\\n\"\n",
    "            for i, assay in enumerate(results[\"niosh_assays\"][:10], 1):\n",
    "                context += f\"{i}. Assay: {assay.get('name', 'Unknown')}\\n\"\n",
    "                context += f\"   Description: {assay.get('description', 'Not specified')}\\n\"\n",
    "                if assay.get('value'):\n",
    "                    context += f\"   Value: {assay.get('value')}\"\n",
    "                    if assay.get('unit'):\n",
    "                        context += f\" {assay.get('unit')}\"\n",
    "                    context += \"\\n\"\n",
    "                context += \"\\n\"\n",
    "        \n",
    "        # Format combined insights\n",
    "        if results[\"combined_data\"]:\n",
    "            context += \"## Combined Insights\\n\\n\"\n",
    "            for i, item in enumerate(results[\"combined_data\"][:5], 1):\n",
    "                product = item[\"product\"]\n",
    "                assay = item[\"assay\"]\n",
    "                context += f\"{i}. Product with {product.get('nanomaterial')} ({product.get('product_type')})\\n\"\n",
    "                context += f\"   Related assay: {assay.get('name')} - {assay.get('description')}\\n\\n\"\n",
    "        \n",
    "        return context\n",
    "    \n",
    "    def answer_question(self, question):\n",
    "        \"\"\"\n",
    "        Answer a question using the nanotoxicology RAG system\n",
    "        \"\"\"\n",
    "        # Analyze the question\n",
    "        analysis = self.analyze_question(question)\n",
    "        print(f\"Question analysis: {analysis}\")\n",
    "        \n",
    "        # Retrieve relevant data\n",
    "        results = self.retrieve_relevant_data(analysis)\n",
    "        print(f\"Retrieved {len(results['cpsc_products'])} products and {len(results['niosh_assays'])} assays\")\n",
    "        \n",
    "        # Format context for LLM\n",
    "        context = self.format_results_for_context(results)\n",
    "        \n",
    "        # Generate answer with updated API\n",
    "        system_prompt = \"You are an expert in nanotoxicology and nanomaterials science specializing in safety assessment and regulatory analysis.\"\n",
    "        \n",
    "        user_prompt = f\"\"\"Use the following information from a nanotoxicology knowledge database to answer the question.\n",
    "If the information needed is not available in the provided context, say that you don't have enough information from the knowledge base, but provide general information about the topic based on your knowledge.\n",
    "\n",
    "KNOWLEDGE DATABASE CONTEXT:\n",
    "{context}\n",
    "\n",
    "QUESTION: {question}\n",
    "\n",
    "Provide a comprehensive answer that:\n",
    "1. Directly addresses the question\n",
    "2. Cites specific examples from the knowledge base where relevant\n",
    "3. Explains the significance of findings in plain language\n",
    "4. Acknowledges data limitations where appropriate\n",
    "\"\"\"\n",
    "        \n",
    "        response = self.openai_client.chat.completions.create(\n",
    "            model=self.model,\n",
    "            messages=[\n",
    "                {\"role\": \"system\", \"content\": system_prompt},\n",
    "                {\"role\": \"user\", \"content\": user_prompt}\n",
    "            ],\n",
    "            temperature=0.4\n",
    "        )\n",
    "        \n",
    "        return response.choices[0].message.content.strip()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- EXAMPLE 1: Query Silver Products ---\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (product)\n",
      "        WHERE 'CPSC' IN product.graphs\n",
      "        AND (\n",
      "          $search_term IS NULL OR\n",
      "          (product.NPO_1808 IS NOT NULL AND product.NPO_1808 CONTAINS $search_term) OR\n",
      "          (product.C93401 IS NOT NULL AND product.C93401 CONTAINS $search_term) OR\n",
      "          (product.C43530 IS NOT NULL AND product.C43530 CONTAINS $search_term)\n",
      "        )\n",
      "        RETURN \n",
      "          product.uri AS uri,\n",
      "          product.NPO_1808 AS nanomaterial,\n",
      "          product.C43530 AS manufacturer,\n",
      "          product.C93401 AS product_type,\n",
      "          product.C25464 AS country,\n",
      "          product.C93400 AS category\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"search_term\": \"Silver\",\n",
      "  \"limit\": 50\n",
      "}\n",
      "\n",
      "Query returned 50 results\n",
      "Found 50 silver products\n",
      "- Cleaner by Nanobiz (Poland)\n",
      "- Shirt by NanoSilver (Czech Republic)\n",
      "- Shorts by NanoSilver (Czech Republic)\n",
      "\n",
      "--- EXAMPLE 2: Data Statistics ---\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (product)\n",
      "        WHERE 'CPSC' IN product.graphs\n",
      "        AND product.NPO_1808 IS NOT NULL\n",
      "        WITH product.NPO_1808 AS material, count(*) AS count\n",
      "        RETURN material, count\n",
      "        ORDER BY count DESC\n",
      "        \n",
      "\n",
      "Query returned 192 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (assay)\n",
      "        WHERE 'NIOSH' IN assay.graphs\n",
      "        AND 'Assay' IN labels(assay)\n",
      "        AND assay.label IS NOT NULL\n",
      "        WITH assay.label AS assay_type, count(*) AS count\n",
      "        RETURN assay_type, count\n",
      "        ORDER BY count DESC\n",
      "        \n",
      "\n",
      "Query returned 6 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (n)\n",
      "        UNWIND n.graphs AS source\n",
      "        WITH source, count(*) AS count\n",
      "        RETURN source, count\n",
      "        ORDER BY count DESC\n",
      "        \n",
      "\n",
      "Query returned 2 results\n",
      "\n",
      "Data Statistics:\n",
      "\n",
      "Sources:\n",
      "- NIOSH: 4610 nodes\n",
      "- CPSC: 2785 nodes\n",
      "\n",
      "Nanomaterials in Consumer Products:\n",
      "- Unknown: 1156 products\n",
      "- Unspecified nanomaterials: 484 products\n",
      "- Silver: 254 products\n",
      "- Nanosilver: 113 products\n",
      "- Titanium: 70 products\n",
      "- Carbon nanotube: 44 products\n",
      "- Phosphate: 40 products\n",
      "- Carbon nanotubes: 37 products\n",
      "- bamboo-charcoal nano-particles: 36 products\n",
      "- Bamboo charcoal: 31 products\n",
      "- Silica: 23 products\n",
      "- Carbon Nanotubes: 22 products\n",
      "- Carbon: 17 products\n",
      "- Nano-Tex technology: 17 products\n",
      "- Fullerene - nano carbon: 16 products\n",
      "- Nano carbon - unspecified: 15 products\n",
      "- Nano titanium: 15 products\n",
      "- Silicon dioxide: 14 products\n",
      "- Nano diamond: 13 products\n",
      "- Silicon: 11 products\n",
      "- Silicone: 11 products\n",
      "- Nano titanium dioxide: 10 products\n",
      "- Nano diamond composite: 10 products\n",
      "- Gold: 9 products\n",
      "- Titanium Dioxide (2-3nm): 9 products\n",
      "- Nanosphere® : 8 products\n",
      "- Nanophosphate: 7 products\n",
      "- Nano Silver: 7 products\n",
      "- Nano silicon oxide: 7 products\n",
      "- Nansulate™ : 6 products\n",
      "- Nanodiamond: 6 products\n",
      "- Graphene: 6 products\n",
      "- carbon nanotubes: 5 products\n",
      "- unknown: 5 products\n",
      "- cerium oxide: 5 products\n",
      "- Steel: 5 products\n",
      "- Nano coating: 5 products\n",
      "- Polytetrafluoroethylene: 5 products\n",
      "- Nanoscale process: 5 products\n",
      "- Graphite: 4 products\n",
      "- Demron™: 4 products\n",
      "- Nano tourmaline: 4 products\n",
      "- Al2O3: 4 products\n",
      "- MCS® Blocker nanotechnology: 4 products\n",
      "- NanoGUARD: 4 products\n",
      "- Nano Titanium Dioxide: 3 products\n",
      "- Nano Aluminum: 3 products\n",
      "- Poron®: 3 products\n",
      "- Nano Silver™ : 3 products\n",
      "- Nano iron: 3 products\n",
      "- Nano silicone: 3 products\n",
      "- Carbon, Titanium: 3 products\n",
      "- Carbon, Fullerenes: 3 products\n",
      "- Nano-Care™: 3 products\n",
      "- Nanoprotect® CS: 3 products\n",
      "- Nanogold: 3 products\n",
      "- Silver, Titanium: 3 products\n",
      "- NanoFilm Barrier Coating : 3 products\n",
      "- Pilkington Activ™ coating: 2 products\n",
      "- Hydroxyapatite: 2 products\n",
      "- Nano carnauba wax: 2 products\n",
      "- Nanocide™: 2 products\n",
      "- Copper: 2 products\n",
      "- Nano-Dry®: 2 products\n",
      "- Nano Silver : 2 products\n",
      "- NanoWeb®: 2 products\n",
      "- Nano Filter- Nano Confined Catalytic Oxidation: 2 products\n",
      "- Hybtonite™ epoxy (Composite resins reinforced with carbon nanotubes): 2 products\n",
      "- Nano crystal - unspecified: 2 products\n",
      "- Nano-Tex ( nano silver): 2 products\n",
      "- Sandvik Nanoflex® : 2 products\n",
      "- Nano metal - unspecified: 2 products\n",
      "- Nano Diamond: 2 products\n",
      "- Nanofuse™: 2 products\n",
      "- Nanofiber: 2 products\n",
      "- quad Nano XtremeTM: 2 products\n",
      "- 3-(trimethoxysilyl)propyldimethyloctadecyl ammonium chloride : 2 products\n",
      "- Nanoceramics : 2 products\n",
      "- Thermalon™ : 2 products\n",
      "- accelerate silver ionic flux: 2 products\n",
      "- Texcote: 2 products\n",
      "- Nano Carbon Fiber: 2 products\n",
      "- Gold, Titanium: 2 products\n",
      "- Nano Tex: 2 products\n",
      "- Graphite, Titanium: 2 products\n",
      "- sillcon: 2 products\n",
      "- Nano zinc: 2 products\n",
      "- Li-ion: 1 products\n",
      "- nano diamond composite: 1 products\n",
      "- MAM or SAS: 1 products\n",
      "- silicon: 1 products\n",
      "- Z-Cote® transparent zinc oxide: 1 products\n",
      "- microfine zinc oxide: 1 products\n",
      "- Nano Carbon Tubes: 1 products\n",
      "- Alpha diamond: 1 products\n",
      "- Calcium, Unknown: 1 products\n",
      "- Sanagloss™ nanotechnology: 1 products\n",
      "- Tiatnium: 1 products\n",
      "- Nanowire: 1 products\n",
      "- vinyl chloride-based: 1 products\n",
      "- Nano 8 Technology: 1 products\n",
      "- Carbon Nanotube Metal Matrix Composite: 1 products\n",
      "- NanoMist: 1 products\n",
      "- Art CoolTM: 1 products\n",
      "- AEROTAXY®: 1 products\n",
      "- NanoSilver: 1 products\n",
      "- Nano Bamboo Charcoal Fibers: 1 products\n",
      "- Nano Silica (2nm-50nm): 1 products\n",
      "- PTFE: 1 products\n",
      "- Nano ceramic, Nano touramline: 1 products\n",
      "- TPO polypropylene-based: 1 products\n",
      "- Nano Zinc Oxide (40 nm-140nm): 1 products\n",
      "- Nanotol Sealant: 1 products\n",
      "- Micronized Zinc Oxide: 1 products\n",
      "- Nanocopper: 1 products\n",
      "- Nano CFC: 1 products\n",
      "- ethylene propylene diene: 1 products\n",
      "- Silicon On Insulator (SOI): 1 products\n",
      "- PTFE and polysilazanes: 1 products\n",
      "- Nickel: 1 products\n",
      "- Aluminium: 1 products\n",
      "- Silver, Unknown: 1 products\n",
      "- Fullerenes: 1 products\n",
      "- Multi crosslinking polyplexins: 1 products\n",
      "- Polytetrafluoroethyelen: 1 products\n",
      "- Nano Nickel: 1 products\n",
      "- black glass fibre textile: 1 products\n",
      "- nano diamond: 1 products\n",
      "- metallic oxides : 1 products\n",
      "- polypropylene : 1 products\n",
      "- titan compounds: 1 products\n",
      "- Lithium: 1 products\n",
      "- calcium hydroxide nano-particles: 1 products\n",
      "- \"highly micronized\" Titanium Dioxide: 1 products\n",
      "- Hydrophobic nano particles: 1 products\n",
      "- Aluminum: 1 products\n",
      "- spherical oxide: 1 products\n",
      "- Silver Dioxide: 1 products\n",
      "- Tungsten Carbide, Cobalt, and Chromium: 1 products\n",
      "- aluminum oxide: 1 products\n",
      "- aerogel: 1 products\n",
      "- copper indium: 1 products\n",
      "- CVD: 1 products\n",
      "- ceramic nanopaticles: 1 products\n",
      "- Nanoquartz: 1 products\n",
      "- Nano-Sphere fabric finishing: 1 products\n",
      "- Zinc Oxide: 1 products\n",
      "- Thermopox: 1 products\n",
      "- microglass fibres and cellulose infused with nanoalumina fibres: 1 products\n",
      "- fullerene-like tungsten disulfide: 1 products\n",
      "- ceramic-polymer-hybrid coating: 1 products\n",
      "- nano-sized carnauba particles: 1 products\n",
      "- gallium arsenide nanowires: 1 products\n",
      "- Nanofluoride: 1 products\n",
      "- NDMX™: 1 products\n",
      "- Sub-Micronized \"transparent\"  Titanium Dioxide ( A few nm- 10 Microns) , Sub- Micronized Zinc Oxide (80-150nm): 1 products\n",
      "- Nano Ceramic® , nano silver, nano tourmaline: 1 products\n",
      "- WS2, BN, PTFE, and graphite: 1 products\n",
      "- Nano photo-copper zinc: 1 products\n",
      "- cycloaliphatic amine epoxy: 1 products\n",
      "- Self-Assembled Monolayer of Phosphonates: 1 products\n",
      "- nano-quartz particles: 1 products\n",
      "- Nano Silver - 25nm: 1 products\n",
      "- Nickle: 1 products\n",
      "- fluorine polyurethane acrylic polymer: 1 products\n",
      "- Copper, Zinc: 1 products\n",
      "- Nano Ceramic® , Nano tourmaline: 1 products\n",
      "- Nano SCS: 1 products\n",
      "- Bamboo charcoal, Gold: 1 products\n",
      "- Silver, Titanium dioxide: 1 products\n",
      "- germanium-on-silicon: 1 products\n",
      "- Cordura Brand® Ballistic Fabric: 1 products\n",
      "- Carbon naotubes: 1 products\n",
      "-  blend of PTFE and polysilazanes: 1 products\n",
      "- Carnauba wax: 1 products\n",
      "- Fluoropolymer: 1 products\n",
      "- Nanonickle: 1 products\n",
      "- polyvinylbutyral: 1 products\n",
      "- copper-indium-gallium-diselenide: 1 products\n",
      "- polybutadienes: 1 products\n",
      "- Nano Zinco Oxide (Z-cote): 1 products\n",
      "- nFusion Technology: 1 products\n",
      "- Titanium dioxide (2-3nm): 1 products\n",
      "- boron nitride coating: 1 products\n",
      "- Nano Carnauba (leaves of the Copernicia prunifera palm) : 1 products\n",
      "- Ultra-Micronized Titanium Dioxide and Zince Oxide: 1 products\n",
      "- Iron: 1 products\n",
      "- Nano Kiyoseki Minerals: 1 products\n",
      "- nanostructured lithium-titanate: 1 products\n",
      "- Nanoceramics, Nano Kiyoseki Minerals: 1 products\n",
      "- Silver and titanium nanoelements: 1 products\n",
      "- Polyurethane: 1 products\n",
      "\n",
      "Assay Types in NIOSH Data:\n",
      "- Cytokine level/production: 124 assays\n",
      "- Other: 62 assays\n",
      "- LDH: 62 assays\n",
      "- Cytokine Level: 48 assays\n",
      "- BAL PMN (Count): 24 assays\n",
      "- BAL PMN (%): 24 assays\n",
      "\n",
      "--- EXAMPLE 3: Search for 'lung' ---\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (n)\n",
      "        WHERE n.uri IS NOT NULL\n",
      "        AND ANY(graph IN n.graphs WHERE graph IN ['CPSC', 'NIOSH'])\n",
      "        AND (\n",
      "            (n.label IS NOT NULL AND n.label CONTAINS $keyword) OR\n",
      "            (n.description IS NOT NULL AND n.description CONTAINS $keyword) OR\n",
      "            (n.NPO_1808 IS NOT NULL AND n.NPO_1808 CONTAINS $keyword) OR\n",
      "            (n.C93401 IS NOT NULL AND n.C93401 CONTAINS $keyword) OR\n",
      "            (n.C43530 IS NOT NULL AND n.C43530 CONTAINS $keyword)\n",
      "        )\n",
      "        RETURN \n",
      "            n.uri AS uri,\n",
      "            labels(n) AS labels,\n",
      "            n.graphs AS sources,\n",
      "            CASE\n",
      "                WHEN n.label IS NOT NULL THEN n.label\n",
      "                WHEN n.description IS NOT NULL THEN n.description\n",
      "                ELSE 'No label'\n",
      "            END AS display_name\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"keyword\": \"lung\",\n",
      "  \"limit\": 25\n",
      "}\n",
      "\n",
      "Query returned 0 results\n",
      "\n",
      "Search results for 'lung':\n",
      "\n",
      "--- EXAMPLE 6: RAG System ---\n",
      "Question analysis: {'nanomaterials': ['silver nanoparticles'], 'products': ['consumer products'], 'assays': ['toxicity'], 'exposure_routes': ['dermal', 'inhalation'], 'targets': ['humans']}\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (product)\n",
      "        WHERE 'CPSC' IN product.graphs\n",
      "        AND (\n",
      "          $search_term IS NULL OR\n",
      "          (product.NPO_1808 IS NOT NULL AND product.NPO_1808 CONTAINS $search_term) OR\n",
      "          (product.C93401 IS NOT NULL AND product.C93401 CONTAINS $search_term) OR\n",
      "          (product.C43530 IS NOT NULL AND product.C43530 CONTAINS $search_term)\n",
      "        )\n",
      "        RETURN \n",
      "          product.uri AS uri,\n",
      "          product.NPO_1808 AS nanomaterial,\n",
      "          product.C43530 AS manufacturer,\n",
      "          product.C93401 AS product_type,\n",
      "          product.C25464 AS country,\n",
      "          product.C93400 AS category\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"search_term\": \"silver nanoparticles\",\n",
      "  \"limit\": 50\n",
      "}\n",
      "\n",
      "Query returned 0 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (product)\n",
      "        WHERE 'CPSC' IN product.graphs\n",
      "        AND (\n",
      "          $search_term IS NULL OR\n",
      "          (product.NPO_1808 IS NOT NULL AND product.NPO_1808 CONTAINS $search_term) OR\n",
      "          (product.C93401 IS NOT NULL AND product.C93401 CONTAINS $search_term) OR\n",
      "          (product.C43530 IS NOT NULL AND product.C43530 CONTAINS $search_term)\n",
      "        )\n",
      "        RETURN \n",
      "          product.uri AS uri,\n",
      "          product.NPO_1808 AS nanomaterial,\n",
      "          product.C43530 AS manufacturer,\n",
      "          product.C93401 AS product_type,\n",
      "          product.C25464 AS country,\n",
      "          product.C93400 AS category\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"search_term\": \"consumer products\",\n",
      "  \"limit\": 50\n",
      "}\n",
      "\n",
      "Query returned 0 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (assay)\n",
      "        WHERE 'NIOSH' IN assay.graphs\n",
      "        AND 'Assay' IN labels(assay)\n",
      "        AND (\n",
      "          $search_term IS NULL OR\n",
      "          (assay.label IS NOT NULL AND assay.label CONTAINS $search_term) OR\n",
      "          (assay.description IS NOT NULL AND assay.description CONTAINS $search_term)\n",
      "        )\n",
      "        RETURN \n",
      "          assay.uri AS uri,\n",
      "          assay.label AS name,\n",
      "          assay.description AS description,\n",
      "          assay.SIO_000300 AS value,\n",
      "          assay.SIO_000221 AS unit\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"search_term\": \"toxicity\",\n",
      "  \"limit\": 50\n",
      "}\n",
      "\n",
      "Query returned 0 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "        MATCH (assay)\n",
      "        WHERE 'NIOSH' IN assay.graphs\n",
      "        AND 'Assay' IN labels(assay)\n",
      "        AND (\n",
      "          $search_term IS NULL OR\n",
      "          (assay.label IS NOT NULL AND assay.label CONTAINS $search_term) OR\n",
      "          (assay.description IS NOT NULL AND assay.description CONTAINS $search_term)\n",
      "        )\n",
      "        RETURN \n",
      "          assay.uri AS uri,\n",
      "          assay.label AS name,\n",
      "          assay.description AS description,\n",
      "          assay.SIO_000300 AS value,\n",
      "          assay.SIO_000221 AS unit\n",
      "        LIMIT $limit\n",
      "        \n",
      "\n",
      "Parameters:\n",
      "{\n",
      "  \"search_term\": \"humans\",\n",
      "  \"limit\": 50\n",
      "}\n",
      "\n",
      "Query returned 0 results\n",
      "\n",
      "Cypher Query:\n",
      "\n",
      "                MATCH (product)\n",
      "                WHERE 'CPSC' IN product.graphs\n",
      "                AND product.NPO_1808 IS STRING\n",
      "                WITH product.NPO_1808 AS material, count(*) AS count\n",
      "                RETURN material, count\n",
      "                ORDER BY count DESC\n",
      "                \n",
      "Error getting nanomaterial stats: {code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch: expected Node or Relationship but was Boolean, Float, Integer, Number, Point, String, Duration, Date, Time, LocalTime, LocalDateTime, DateTime, List<Boolean>, List<Float>, List<Integer>, List<Number>, List<Point>, List<String>, List<Duration>, List<Date>, List<Time>, List<LocalTime>, List<LocalDateTime> or List<DateTime> (line 4, column 21 (offset: 100))\n",
      "\"                AND product.NPO_1808 IS STRING\"\n",
      "                     ^}\n",
      "Retrieved 0 products and 0 assays\n",
      "\n",
      "Question: What consumer products contain silver nanoparticles and what do we know about their toxicity?\n",
      "\n",
      "Answer: Based on the available information in the nanotoxicology knowledge base, silver nanoparticles are commonly used in consumer products due to their antimicrobial properties. Some consumer products that may contain silver nanoparticles include:\n",
      "\n",
      "1. Textiles: Silver nanoparticles are used in textiles like clothing, socks, and towels to impart antimicrobial properties and prevent odor-causing bacteria growth.\n",
      "2. Personal care products: Silver nanoparticles can be found in cosmetics, skincare products, and wound dressings for their antibacterial effects.\n",
      "3. Food packaging: Silver nanoparticles are utilized in food packaging materials to enhance food safety by inhibiting bacterial growth.\n",
      "\n",
      "In terms of toxicity, silver nanoparticles have been extensively studied in nanotoxicology research. While silver nanoparticles exhibit strong antimicrobial properties, their potential toxicity to humans and the environment is a subject of concern. Specific findings from the knowledge base indicate that:\n",
      "\n",
      "1. **Ingestion**: Silver nanoparticles can potentially accumulate in the body upon ingestion, leading to concerns about systemic toxicity.\n",
      "2. **Skin exposure**: Skin contact with products containing silver nanoparticles may cause skin irritation or sensitization in some individuals.\n",
      "3. **Environmental impact**: Silver nanoparticles released into the environment through consumer products can impact aquatic organisms and ecosystems.\n",
      "\n",
      "The significance of these findings is that while silver nanoparticles offer valuable antimicrobial benefits in consumer products, their potential adverse effects on human health and the environment must be carefully considered. Regulatory agencies are actively assessing the safety of silver nanoparticles in consumer products to ensure their responsible use.\n",
      "\n",
      "However, it's important to note that the data limitations in the knowledge base may include the need for further research on the long-term effects of silver nanoparticles exposure and the potential risks associated with their widespread use in consumer products. Additional studies are necessary to fully understand the toxicity profile of silver nanoparticles and to establish safe exposure limits for different applications.\n",
      "\n",
      "--- EXAMPLE 7: Interactive Mode ---\n",
      "\n",
      "Ask questions about nanotoxicology (type 'exit' to quit):\n"
     ]
    }
   ],
   "source": [
    "import openai\n",
    "from neo4j import GraphDatabase\n",
    "import json\n",
    "from typing import List, Dict, Any, Optional\n",
    "\n",
    "class NanotoxicologyRAG:\n",
    "    \"\"\"\n",
    "    Complete Nanotoxicology RAG system with integrated querying capabilities\n",
    "    \"\"\"\n",
    "    def __init__(self, \n",
    "                 neo4j_uri: str, \n",
    "                 neo4j_user: str, \n",
    "                 neo4j_password: str,\n",
    "                 openai_api_key: str,\n",
    "                 model: str = \"gpt-3.5-turbo\",\n",
    "                 verbose: bool = False):\n",
    "        \"\"\"\n",
    "        Initialize the RAG system for nanotoxicology\n",
    "        \n",
    "        Args:\n",
    "            neo4j_uri: URI for Neo4j database\n",
    "            neo4j_user: Neo4j username\n",
    "            neo4j_password: Neo4j password\n",
    "            openai_api_key: OpenAI API key\n",
    "            model: OpenAI model to use\n",
    "            verbose: Whether to print Cypher queries\n",
    "        \"\"\"\n",
    "        self.driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_password))\n",
    "        self.openai_client = openai.OpenAI(api_key=openai_api_key)\n",
    "        self.model = model\n",
    "        self.verbose = verbose\n",
    "\n",
    "    def close(self):\n",
    "        \"\"\"Close the database connection\"\"\"\n",
    "        self.driver.close()\n",
    "    \n",
    "    def run_query(self, query: str, params: dict = None) -> List[Dict]:\n",
    "        \"\"\"Run a Cypher query and return results\"\"\"\n",
    "        if params is None:\n",
    "            params = {}\n",
    "            \n",
    "        if self.verbose:\n",
    "            print(\"\\nCypher Query:\")\n",
    "            print(query)\n",
    "            if params:\n",
    "                print(\"\\nParameters:\")\n",
    "                print(json.dumps(params, indent=2))\n",
    "        \n",
    "        with self.driver.session() as session:\n",
    "            results = session.run(query, **params).data()\n",
    "            \n",
    "            if self.verbose:\n",
    "                print(f\"\\nQuery returned {len(results)} results\")\n",
    "            \n",
    "            return results\n",
    "    \n",
    "    # QUERY FUNCTIONS\n",
    "    \n",
    "    def query_cpsc_products(self, search_term=None, limit=50):\n",
    "        \"\"\"Query CPSC products\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (product)\n",
    "        WHERE 'CPSC' IN product.graphs\n",
    "        AND (\n",
    "          $search_term IS NULL OR\n",
    "          (product.NPO_1808 IS NOT NULL AND product.NPO_1808 CONTAINS $search_term) OR\n",
    "          (product.C93401 IS NOT NULL AND product.C93401 CONTAINS $search_term) OR\n",
    "          (product.C43530 IS NOT NULL AND product.C43530 CONTAINS $search_term)\n",
    "        )\n",
    "        RETURN \n",
    "          product.uri AS uri,\n",
    "          product.NPO_1808 AS nanomaterial,\n",
    "          product.C43530 AS manufacturer,\n",
    "          product.C93401 AS product_type,\n",
    "          product.C25464 AS country,\n",
    "          product.C93400 AS category\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query, {\"search_term\": search_term, \"limit\": limit})\n",
    "    \n",
    "    def query_niosh_assays(self, search_term=None, limit=50):\n",
    "        \"\"\"Query NIOSH assay data\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (assay)\n",
    "        WHERE 'NIOSH' IN assay.graphs\n",
    "        AND 'Assay' IN labels(assay)\n",
    "        AND (\n",
    "          $search_term IS NULL OR\n",
    "          (assay.label IS NOT NULL AND assay.label CONTAINS $search_term) OR\n",
    "          (assay.description IS NOT NULL AND assay.description CONTAINS $search_term)\n",
    "        )\n",
    "        RETURN \n",
    "          assay.uri AS uri,\n",
    "          assay.label AS name,\n",
    "          assay.description AS description,\n",
    "          assay.SIO_000300 AS value,\n",
    "          assay.SIO_000221 AS unit\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query, {\"search_term\": search_term, \"limit\": limit})\n",
    "    \n",
    "    def query_product_assay_connections(self, limit=25):\n",
    "        \"\"\"Find connections between products and assays\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (product), (assay)\n",
    "        WHERE 'CPSC' IN product.graphs\n",
    "        AND 'NIOSH' IN assay.graphs\n",
    "        AND 'Assay' IN labels(assay)\n",
    "        AND product.NPO_1808 IS NOT NULL\n",
    "        AND assay.description IS NOT NULL\n",
    "        AND any(material IN split(toLower(product.NPO_1808), ' ') \n",
    "               WHERE toLower(assay.description) CONTAINS material)\n",
    "        RETURN \n",
    "          product.NPO_1808 AS nanomaterial,\n",
    "          product.C93401 AS product_type,\n",
    "          product.C43530 AS manufacturer,\n",
    "          assay.label AS assay_name,\n",
    "          assay.description AS assay_description\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query, {\"limit\": limit})\n",
    "    \n",
    "    def count_products_by_nanomaterial(self):\n",
    "        \"\"\"Count products by nanomaterial type\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (product)\n",
    "        WHERE 'CPSC' IN product.graphs\n",
    "        AND product.NPO_1808 IS NOT NULL\n",
    "        WITH product.NPO_1808 AS material, count(*) AS count\n",
    "        RETURN material, count\n",
    "        ORDER BY count DESC\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query)\n",
    "    \n",
    "    def count_niosh_assays_by_type(self):\n",
    "        \"\"\"Count NIOSH assays by type\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (assay)\n",
    "        WHERE 'NIOSH' IN assay.graphs\n",
    "        AND 'Assay' IN labels(assay)\n",
    "        AND assay.label IS NOT NULL\n",
    "        WITH assay.label AS assay_type, count(*) AS count\n",
    "        RETURN assay_type, count\n",
    "        ORDER BY count DESC\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query)\n",
    "    \n",
    "    def search_across_all_properties(self, search_term, limit=25):\n",
    "        \"\"\"Search for a term across all properties with improved type handling\"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (n)\n",
    "        WHERE n.uri IS NOT NULL\n",
    "        AND ANY(graph IN n.graphs WHERE graph IN ['CPSC', 'NIOSH'])\n",
    "        AND ANY(prop IN keys(n) WHERE \n",
    "            prop <> 'uri' AND\n",
    "            prop <> 'graphs' AND\n",
    "            n[prop] IS NOT NULL AND\n",
    "            CASE\n",
    "                WHEN n[prop] IS STRING THEN \n",
    "                    toLower(n[prop]) CONTAINS toLower($search_term)\n",
    "                WHEN n[prop] IS INTEGER OR n[prop] IS FLOAT THEN \n",
    "                    toString(n[prop]) CONTAINS $search_term\n",
    "                ELSE false\n",
    "            END\n",
    "        )\n",
    "        RETURN \n",
    "        n.uri AS uri,\n",
    "        labels(n) AS labels,\n",
    "        n.graphs AS sources,\n",
    "        CASE\n",
    "            WHEN n.label IS NOT NULL THEN n.label\n",
    "            WHEN n.description IS NOT NULL THEN n.description\n",
    "            ELSE 'No label'\n",
    "        END AS display_name,\n",
    "        [prop IN keys(n) WHERE \n",
    "            prop <> 'uri' AND \n",
    "            prop <> 'graphs' AND \n",
    "            n[prop] IS NOT NULL AND\n",
    "            CASE\n",
    "                WHEN n[prop] IS STRING THEN \n",
    "                    toLower(n[prop]) CONTAINS toLower($search_term)\n",
    "                WHEN n[prop] IS INTEGER OR n[prop] IS FLOAT THEN \n",
    "                    toString(n[prop]) CONTAINS $search_term\n",
    "                ELSE false\n",
    "            END\n",
    "        ] AS matching_properties\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        return self.run_query(query, {\"search_term\": search_term, \"limit\": limit})\n",
    "    \n",
    "    def simple_search_keyword(self, keyword, limit=25):\n",
    "        \"\"\"\n",
    "        Ultra-simple search function that only checks common string properties\n",
    "        \"\"\"\n",
    "        query = \"\"\"\n",
    "        MATCH (n)\n",
    "        WHERE n.uri IS NOT NULL\n",
    "        AND ANY(graph IN n.graphs WHERE graph IN ['CPSC', 'NIOSH'])\n",
    "        AND (\n",
    "            (n.label IS NOT NULL AND n.label CONTAINS $keyword) OR\n",
    "            (n.description IS NOT NULL AND n.description CONTAINS $keyword) OR\n",
    "            (n.NPO_1808 IS NOT NULL AND n.NPO_1808 CONTAINS $keyword) OR\n",
    "            (n.C93401 IS NOT NULL AND n.C93401 CONTAINS $keyword) OR\n",
    "            (n.C43530 IS NOT NULL AND n.C43530 CONTAINS $keyword)\n",
    "        )\n",
    "        RETURN \n",
    "            n.uri AS uri,\n",
    "            labels(n) AS labels,\n",
    "            n.graphs AS sources,\n",
    "            CASE\n",
    "                WHEN n.label IS NOT NULL THEN n.label\n",
    "                WHEN n.description IS NOT NULL THEN n.description\n",
    "                ELSE 'No label'\n",
    "            END AS display_name\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "        \n",
    "        results = self.run_query(query, {\"keyword\": keyword, \"limit\": limit})\n",
    "        \n",
    "        print(f\"\\nSearch results for '{keyword}':\")\n",
    "        for i, result in enumerate(results, 1):\n",
    "            sources = ', '.join(result['sources'])\n",
    "            print(f\"{i}. [{sources}] {result['display_name']}\")\n",
    "        \n",
    "        return results\n",
    "        \n",
    "    # RAG FUNCTIONS\n",
    "    \n",
    "    def analyze_question(self, question):\n",
    "        \"\"\"\n",
    "        Analyze the user's question to determine query strategy\n",
    "        \"\"\"\n",
    "        prompt = f\"\"\"\n",
    "        Analyze this question about nanotoxicology and determine the key search criteria.\n",
    "        \n",
    "        Question: {question}\n",
    "        \n",
    "        Please identify:\n",
    "        1. Mentioned nanomaterials (e.g., silver, titanium dioxide, carbon nanotubes)\n",
    "        2. Product types or categories (e.g., baby products, kitchenware, air filters)\n",
    "        3. Toxicology assays or endpoints (e.g., cytotoxicity, genotoxicity, LDH assay)\n",
    "        4. Exposure routes (e.g., inhalation, dermal)\n",
    "        5. Target organs or organisms (e.g., lung, skin, mice)\n",
    "        \n",
    "        Return as JSON with these keys: \n",
    "        {{\"nanomaterials\": [...], \"products\": [...], \"assays\": [...], \"exposure_routes\": [...], \"targets\": [...]}}\n",
    "        \"\"\"\n",
    "        \n",
    "        # Using the OpenAI API\n",
    "        response = self.openai_client.chat.completions.create(\n",
    "            model=self.model,\n",
    "            messages=[\n",
    "                {\"role\": \"system\", \"content\": \"You are a nanotoxicology expert assistant.\"},\n",
    "                {\"role\": \"user\", \"content\": prompt}\n",
    "            ],\n",
    "            temperature=0.3\n",
    "        )\n",
    "        \n",
    "        try:\n",
    "            result_text = response.choices[0].message.content.strip()\n",
    "            return json.loads(result_text)\n",
    "        except:\n",
    "            # Fallback if JSON parsing fails\n",
    "            return {\n",
    "                \"nanomaterials\": [],\n",
    "                \"products\": [],\n",
    "                \"assays\": [],\n",
    "                \"exposure_routes\": [],\n",
    "                \"targets\": []\n",
    "            }\n",
    "    \n",
    "    def retrieve_relevant_data(self, analysis):\n",
    "        \"\"\"\n",
    "        Retrieve data relevant to the question based on analysis\n",
    "        with safer type handling\n",
    "        \"\"\"\n",
    "        results = {\n",
    "            \"cpsc_products\": [],\n",
    "            \"niosh_assays\": [],\n",
    "            \"combined_data\": [],\n",
    "            \"nanomaterial_stats\": []\n",
    "        }\n",
    "    \n",
    "        # Query CPSC products - safe version\n",
    "        try:\n",
    "            for material in analysis.get(\"nanomaterials\", []):\n",
    "                product_results = self.query_cpsc_products(material)\n",
    "                results[\"cpsc_products\"].extend(product_results)\n",
    "            \n",
    "            for product in analysis.get(\"products\", []):\n",
    "                product_results = self.query_cpsc_products(product)\n",
    "                results[\"cpsc_products\"].extend(product_results)\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying CPSC products: {e}\")\n",
    "            # Try a simpler product query if the main one fails\n",
    "            try:\n",
    "                simple_query = \"\"\"\n",
    "                MATCH (product)\n",
    "                WHERE 'CPSC' IN product.graphs\n",
    "                AND product.NPO_1808 IS STRING\n",
    "                RETURN \n",
    "                product.uri AS uri,\n",
    "                product.NPO_1808 AS nanomaterial,\n",
    "                product.C43530 AS manufacturer,\n",
    "                product.C93401 AS product_type,\n",
    "                product.C25464 AS country,\n",
    "                product.C93400 AS category\n",
    "                LIMIT 10\n",
    "                \"\"\"\n",
    "                results[\"cpsc_products\"] = self.run_query(simple_query)\n",
    "            except:\n",
    "                pass\n",
    "        \n",
    "        # Query NIOSH assays - safe version\n",
    "        try:\n",
    "            for assay in analysis.get(\"assays\", []):\n",
    "                assay_results = self.query_niosh_assays(assay)\n",
    "                results[\"niosh_assays\"].extend(assay_results)\n",
    "            \n",
    "            for target in analysis.get(\"targets\", []):\n",
    "                assay_results = self.query_niosh_assays(target)\n",
    "                results[\"niosh_assays\"].extend(assay_results)\n",
    "        except Exception as e:\n",
    "            print(f\"Error querying NIOSH assays: {e}\")\n",
    "            # Try a simpler assay query if the main one fails\n",
    "            try:\n",
    "                simple_query = \"\"\"\n",
    "                MATCH (assay)\n",
    "                WHERE 'NIOSH' IN assay.graphs\n",
    "                AND 'Assay' IN labels(assay)\n",
    "                AND assay.label IS STRING\n",
    "                RETURN \n",
    "                assay.uri AS uri,\n",
    "                assay.label AS name,\n",
    "                assay.description AS description,\n",
    "                assay.SIO_000300 AS value,\n",
    "                assay.SIO_000221 AS unit\n",
    "                LIMIT 10\n",
    "                \"\"\"\n",
    "                results[\"niosh_assays\"] = self.run_query(simple_query)\n",
    "            except:\n",
    "                pass\n",
    "        \n",
    "        # Get product stats by nanomaterial - safe version\n",
    "        try:\n",
    "            if analysis.get(\"nanomaterials\") or not results[\"cpsc_products\"]:\n",
    "                query = \"\"\"\n",
    "                MATCH (product)\n",
    "                WHERE 'CPSC' IN product.graphs\n",
    "                AND product.NPO_1808 IS STRING\n",
    "                WITH product.NPO_1808 AS material, count(*) AS count\n",
    "                RETURN material, count\n",
    "                ORDER BY count DESC\n",
    "                \"\"\"\n",
    "                results[\"nanomaterial_stats\"] = self.run_query(query)\n",
    "        except Exception as e:\n",
    "            print(f\"Error getting nanomaterial stats: {e}\")\n",
    "        \n",
    "        # Try to find connections - safe version\n",
    "        try:\n",
    "            if results[\"cpsc_products\"] and results[\"niosh_assays\"]:\n",
    "                # Manual approach to find connections\n",
    "                combined_data = []\n",
    "                for product in results[\"cpsc_products\"]:\n",
    "                    nanomaterial = product.get(\"nanomaterial\", \"\")\n",
    "                    if not nanomaterial or not isinstance(nanomaterial, str):\n",
    "                        continue\n",
    "                        \n",
    "                    for assay in results[\"niosh_assays\"]:\n",
    "                        description = assay.get(\"description\", \"\")\n",
    "                        if not description or not isinstance(description, str):\n",
    "                            continue\n",
    "                            \n",
    "                        # Simple substring check\n",
    "                        if nanomaterial.lower() in description.lower():\n",
    "                            combined_data.append({\n",
    "                                \"product\": product,\n",
    "                                \"assay\": assay,\n",
    "                                \"relevance\": \"Material match\"\n",
    "                            })\n",
    "                \n",
    "                results[\"combined_data\"] = combined_data\n",
    "        except Exception as e:\n",
    "            print(f\"Error finding connections: {e}\")\n",
    "        \n",
    "        # Deduplicate results\n",
    "        results[\"cpsc_products\"] = self._deduplicate_by_uri(results[\"cpsc_products\"])\n",
    "        results[\"niosh_assays\"] = self._deduplicate_by_uri(results[\"niosh_assays\"])\n",
    "        \n",
    "        return results\n",
    "\n",
    "    def _deduplicate_by_uri(self, items):\n",
    "        \"\"\"Helper to deduplicate items by URI\"\"\"\n",
    "        seen_uris = set()\n",
    "        unique_items = []\n",
    "        \n",
    "        for item in items:\n",
    "            uri = item.get(\"uri\")\n",
    "            if uri and uri not in seen_uris:\n",
    "                seen_uris.add(uri)\n",
    "                unique_items.append(item)\n",
    "        \n",
    "        return unique_items\n",
    "    \n",
    "    def format_results_for_context(self, results):\n",
    "        \"\"\"\n",
    "        Format query results into context for the LLM\n",
    "        \"\"\"\n",
    "        context = \"# Nanotoxicology Knowledge Base Results\\n\\n\"\n",
    "        \n",
    "        # Format CPSC product information\n",
    "        if results[\"cpsc_products\"]:\n",
    "            context += \"## Consumer Products containing Nanomaterials\\n\\n\"\n",
    "            for i, product in enumerate(results[\"cpsc_products\"][:10], 1):\n",
    "                context += f\"{i}. Product: {product.get('product_type', 'Unknown')}\\n\"\n",
    "                context += f\"   Nanomaterial: {product.get('nanomaterial', 'Not specified')}\\n\"\n",
    "                context += f\"   Manufacturer: {product.get('manufacturer', 'Not specified')}\\n\"\n",
    "                context += f\"   Country: {product.get('country', 'Not specified')}\\n\"\n",
    "                context += f\"   Category: {product.get('category', 'Not specified')}\\n\\n\"\n",
    "        \n",
    "        # Format nanomaterial statistics if available\n",
    "        if results[\"nanomaterial_stats\"] and len(results[\"nanomaterial_stats\"]) > 0:\n",
    "            context += \"## Nanomaterial Statistics\\n\\n\"\n",
    "            context += \"Distribution of nanomaterials in consumer products:\\n\\n\"\n",
    "            for i, stat in enumerate(results[\"nanomaterial_stats\"][:5], 1):\n",
    "                context += f\"{i}. {stat['material']}: {stat['count']} products\\n\"\n",
    "            context += \"\\n\"\n",
    "        \n",
    "        # Format NIOSH assay information\n",
    "        if results[\"niosh_assays\"]:\n",
    "            context += \"## Toxicology Assay Information\\n\\n\"\n",
    "            for i, assay in enumerate(results[\"niosh_assays\"][:10], 1):\n",
    "                context += f\"{i}. Assay: {assay.get('name', 'Unknown')}\\n\"\n",
    "                context += f\"   Description: {assay.get('description', 'Not specified')}\\n\"\n",
    "                if assay.get('value'):\n",
    "                    context += f\"   Value: {assay.get('value')}\"\n",
    "                    if assay.get('unit'):\n",
    "                        context += f\" {assay.get('unit')}\"\n",
    "                    context += \"\\n\"\n",
    "                context += \"\\n\"\n",
    "        \n",
    "        # Format combined insights\n",
    "        if results[\"combined_data\"]:\n",
    "            context += \"## Product-Assay Relationships\\n\\n\"\n",
    "            for i, item in enumerate(results[\"combined_data\"][:5], 1):\n",
    "                product = item[\"product\"]\n",
    "                assay = item[\"assay\"]\n",
    "                context += f\"{i}. Product with {product.get('nanomaterial')} ({product.get('product_type', 'unknown type')})\\n\"\n",
    "                context += f\"   Related assay: {assay.get('name', 'Unnamed')} - {assay.get('description', 'No description')}\\n\\n\"\n",
    "        \n",
    "        return context\n",
    "    \n",
    "    def answer_question(self, question):\n",
    "        \"\"\"\n",
    "        Answer a question using the nanotoxicology RAG system\n",
    "        \"\"\"\n",
    "        # Analyze the question\n",
    "        analysis = self.analyze_question(question)\n",
    "        print(f\"Question analysis: {analysis}\")\n",
    "        \n",
    "        # Retrieve relevant data\n",
    "        results = self.retrieve_relevant_data(analysis)\n",
    "        print(f\"Retrieved {len(results['cpsc_products'])} products and {len(results['niosh_assays'])} assays\")\n",
    "        \n",
    "        # Format context for LLM\n",
    "        context = self.format_results_for_context(results)\n",
    "        \n",
    "        # Generate answer with updated API\n",
    "        system_prompt = \"You are an expert in nanotoxicology and nanomaterials science specializing in safety assessment and regulatory analysis.\"\n",
    "        \n",
    "        user_prompt = f\"\"\"Use the following information from a nanotoxicology knowledge database to answer the question.\n",
    "If the information needed is not available in the provided context, say that you don't have enough information from the knowledge base, but provide general information about the topic based on your knowledge.\n",
    "\n",
    "KNOWLEDGE DATABASE CONTEXT:\n",
    "{context}\n",
    "\n",
    "QUESTION: {question}\n",
    "\n",
    "Provide a comprehensive answer that:\n",
    "1. Directly addresses the question\n",
    "2. Cites specific examples from the knowledge base where relevant\n",
    "3. Explains the significance of findings in plain language\n",
    "4. Acknowledges data limitations where appropriate\n",
    "\"\"\"\n",
    "        \n",
    "        response = self.openai_client.chat.completions.create(\n",
    "            model=self.model,\n",
    "            messages=[\n",
    "                {\"role\": \"system\", \"content\": system_prompt},\n",
    "                {\"role\": \"user\", \"content\": user_prompt}\n",
    "            ],\n",
    "            temperature=0.4\n",
    "        )\n",
    "        \n",
    "        return response.choices[0].message.content.strip()\n",
    "    \n",
    "    # UTILITY AND ANALYSIS FUNCTIONS\n",
    "    \n",
    "    def search_keyword(self, keyword, limit=25):\n",
    "        \"\"\"\n",
    "        Search for a keyword across both datasets\n",
    "        \"\"\"\n",
    "        results = self.search_across_all_properties(keyword, limit)\n",
    "        \n",
    "        print(f\"\\nSearch results for '{keyword}':\")\n",
    "        for i, result in enumerate(results, 1):\n",
    "            sources = ', '.join(result['sources'])\n",
    "            print(f\"{i}. [{sources}] {result['display_name']}\")\n",
    "            if 'matching_properties' in result:\n",
    "                print(f\"   Matching properties: {', '.join(result['matching_properties'])}\")\n",
    "        \n",
    "        return results\n",
    "    \n",
    "    def analyze_data_statistics(self):\n",
    "        \"\"\"\n",
    "        Generate statistics about the data\n",
    "        \"\"\"\n",
    "        # Count products by nanomaterial\n",
    "        material_stats = self.count_products_by_nanomaterial()\n",
    "        \n",
    "        # Count assays by type\n",
    "        assay_stats = self.count_niosh_assays_by_type()\n",
    "        \n",
    "        # Count sources\n",
    "        source_counts = self.run_query(\"\"\"\n",
    "        MATCH (n)\n",
    "        UNWIND n.graphs AS source\n",
    "        WITH source, count(*) AS count\n",
    "        RETURN source, count\n",
    "        ORDER BY count DESC\n",
    "        \"\"\")\n",
    "        \n",
    "        print(\"\\nData Statistics:\")\n",
    "        \n",
    "        print(\"\\nSources:\")\n",
    "        for source in source_counts:\n",
    "            print(f\"- {source['source']}: {source['count']} nodes\")\n",
    "        \n",
    "        print(\"\\nNanomaterials in Consumer Products:\")\n",
    "        for material in material_stats:\n",
    "            print(f\"- {material['material']}: {material['count']} products\")\n",
    "        \n",
    "        print(\"\\nAssay Types in NIOSH Data:\")\n",
    "        for assay in assay_stats:\n",
    "            print(f\"- {assay['assay_type']}: {assay['count']} assays\")\n",
    "        \n",
    "        return {\n",
    "            \"sources\": source_counts,\n",
    "            \"nanomaterials\": material_stats,\n",
    "            \"assay_types\": assay_stats\n",
    "        }\n",
    "    \n",
    "    def export_query_results(self, query_func, filename, *args, **kwargs):\n",
    "        \"\"\"\n",
    "        Run a query and export results to a JSON file\n",
    "        \"\"\"\n",
    "        # Get the function reference from the name if a string is provided\n",
    "        if isinstance(query_func, str):\n",
    "            if hasattr(self, query_func) and callable(getattr(self, query_func)):\n",
    "                query_func = getattr(self, query_func)\n",
    "            else:\n",
    "                raise ValueError(f\"Function {query_func} not found in NanotoxicologyRAG\")\n",
    "        \n",
    "        # Run the query\n",
    "        results = query_func(*args, **kwargs)\n",
    "        \n",
    "        # Export to JSON\n",
    "        with open(filename, 'w') as f:\n",
    "            json.dump(results, f, indent=2)\n",
    "        \n",
    "        print(f\"Exported {len(results)} results to {filename}\")\n",
    "        \n",
    "        return results\n",
    "\n",
    "\n",
    "# Example usage: how to integrate and use this class\n",
    "def use_integrated_system():\n",
    "    # Initialize the system\n",
    "    rag = NanotoxicologyRAG(\n",
    "        neo4j_uri=\"bolt://localhost:7687\",\n",
    "        neo4j_user=\"neo4j\",\n",
    "        neo4j_password=\"ontosearcher\",\n",
    "        openai_api_key=os.getenv(\"OPENAI_API_KEY\"),\n",
    "        model=\"gpt-3.5-turbo\",\n",
    "        verbose=True  \n",
    "    )\n",
    "    \n",
    "    try:\n",
    "        # 1. Direct query example (prints the query)\n",
    "        print(\"\\n--- EXAMPLE 1: Query Silver Products ---\")\n",
    "        silver_products = rag.query_cpsc_products(\"Silver\")\n",
    "        print(f\"Found {len(silver_products)} silver products\")\n",
    "        for product in silver_products[:3]:  # Show first 3\n",
    "            print(f\"- {product['product_type']} by {product['manufacturer']} ({product['country']})\")\n",
    "        \n",
    "        # 2. Data analysis\n",
    "        print(\"\\n--- EXAMPLE 2: Data Statistics ---\")\n",
    "        stats = rag.analyze_data_statistics()\n",
    "        \n",
    "        # 3. Search for a keyword\n",
    "        print(\"\\n--- EXAMPLE 3: Search for 'lung' ---\")\n",
    "        lung_results = rag.simple_search_keyword(\"lung\")\n",
    "        \n",
    "        # 4. Export query results to JSON\n",
    "        # print(\"\\n--- EXAMPLE 4: Export Results ---\")\n",
    "        # rag.export_query_results(rag.query_cpsc_products, \"silver_products.json\", \"Silver\")\n",
    "        \n",
    "\n",
    "        # # 5. Advanced connection query\n",
    "        # print(\"\\n--- EXAMPLE 5: Product-Assay Connections ---\")\n",
    "        # connections = rag.query_product_assay_connections(limit=5)\n",
    "        # for conn in connections:\n",
    "        #     print(f\"- {conn['nanomaterial']} in {conn['product_type']} - Related to assay: {conn['assay_name']}\")\n",
    "        \n",
    "        # 6. RAG question answering\n",
    "        print(\"\\n--- EXAMPLE 6: RAG System ---\")\n",
    "        question = \"What consumer products contain silver nanoparticles and what do we know about their toxicity?\"\n",
    "        answer = rag.answer_question(question)\n",
    "        print(f\"\\nQuestion: {question}\")\n",
    "        print(f\"\\nAnswer: {answer}\")\n",
    "        \n",
    "        # 7. Interactive question answering mode\n",
    "        print(\"\\n--- EXAMPLE 7: Interactive Mode ---\")\n",
    "        print(\"\\nAsk questions about nanotoxicology (type 'exit' to quit):\")\n",
    "        while True:\n",
    "            user_question = input(\"\\nYour question: \")\n",
    "            if user_question.lower() in [\"exit\", \"quit\", \"q\"]:\n",
    "                break\n",
    "                \n",
    "            answer = rag.answer_question(user_question)\n",
    "            print(f\"\\nAnswer: {answer}\")\n",
    "    \n",
    "    finally:\n",
    "        rag.close()\n",
    "\n",
    "# Call this function to use the system\n",
    "if __name__ == \"__main__\":\n",
    "    use_integrated_system()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
